articles/ultimate_guide_for_graphql_with_java.org
# -*- mode: org; -*-

#+startup: indent

#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:nil title:t toc:nil todo:t |:t
#+title: GraphQL and Java
#+subtitle: 
#+date: <2024-04-30 Tue>
#+author: David A. Ventimiglia
#+email: davidaventimiglia@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.3 (Org mode 9.6.15)
#+cite_export:

* What is GraphQL and why do people want it?

GraphQL is an important evolution in the design of Application
Performance Interfaces (API), but even today it can be difficult to
know how to get started with GraphQL, how to move beyond "Getting
Started" with GraphQL, and how to move beyond the conventional wisdom
on GraphQL.  This is especially true for Java.  This guide attempts to
cover all these bases in three steps.  First, I'll tell you what
GraphQL is, and as a bonus I'll tell you what GraphQL /really/ is.
Second, I'll show you how to implement state-of-the-art GraphQL in
Java for a real application.  Third, I'll offer you an alternative
path beyond the state-of-the-art that may suit your needs better in
every dimension.  And, if you feel like skipping to [[*How to choose "Buy" over "Buy"][the end]], who am I
to stop you?  It certainly will save a great deal of effort.

So, what /is/ GraphQL?  Well, GraphQL.org [[https://graphql.org/learn/][says]]

#+begin_quote
GraphQL is a query language for your API, and a server-side runtime
for executing queries using a type system you define for your
data. GraphQL isn’t tied to any specific database or storage engine
and is instead backed by your existing code and data.
#+end_quote

That's not wrong, but let me take a few more runs at it from different
directions.  Sure, GraphQL /is/ "a query language for your API", but
you might as well just say that it /is/ an API, or a way of building
an API.  That puts it in contrast with [[https://htmx.org/essays/rest-explained/][REST]], which GraphQL is an
evolution from and an alternative to.  GraphQL offers several
improvements over REST (or at least, the [[https://en.wikipedia.org/wiki/Richardson_Maturity_Model#Level_2:_HTTP_verbs][way]] that REST is usually
done):

- expressivity :: A client can say exactly what data they need from a
  server, no more and no less.
- efficiency :: Expressivity leads to efficiency gains, reducing
  network chatter and wasted bandwidth.
- discoverability :: In order to know what to say to a server, a
  client needs to know what /can/ be said to a server.  That's where
  discoverability comes in, allowing data consumers to know exactly
  what's available from data producers.
- simplicity :: GraphQL puts clients in the driver's seat, so there
  had better be some good ergonomics for driving.  GraphQL's
  highly-regular machine-readable syntax, simple execution model, and
  simple [[https://spec.graphql.org/][specification]] lend themselves to inter-operable and composable
  tools:
  - [[https://altairgraphql.dev/][query]] [[https://github.com/graphql/graphiql/tree/main/packages/graphiql#readme][tools]]
  - [[https://the-guild.dev/graphql/hive][schema registries]]
  - [[https://the-guild.dev/graphql/mesh][gateways]]
  - [[https://the-guild.dev/graphql/codegen][code generators]]
  - [[https://commerce.nearform.com/open-source/urql/][client]] [[https://www.apollographql.com/docs/react/][libraries]]

But, what /else/ is GraphQL.  What /really/ is GraphQL?  GraphQL is
/also/ a data model for its query language and, despite the name,
neither the query language nor the data model are very "graphy."  The
data model is [[https://spec.graphql.org/October2021/#sec-JSON-Serialization][essentially]] just JSON.  The query language /looks/ like
JSON and can be boiled down to a few simple features:

- types :: A [[https://spec.graphql.org/October2021/#sec-Types][type]] is a simple value (a [[https://spec.graphql.org/October2021/#sec-Scalars][scalar]]) or a set of fields (an
  [[https://spec.graphql.org/October2021/#sec-Objects][object]]).  While you naturally introduce new types for your own
  problem domain, there are few special types (called [[https://spec.graphql.org/October2021/#sec-Language.Operations][Operations]]).
  One of theses is [[https://spec.graphql.org/October2021/#sec-Query][Query]], which is the root of requests for data
  (setting aside [[https://spec.graphql.org/October2021/#sec-Subscription][Subscription]] for now, for the sake of simplicity).  A
  type essentially is a set of rules for determining if a piece of
  data--or a request for that piece of data--validly conforms to the
  given type.  A GraphQL type is very much like a user-defined type in
  programming languages like C++, Java, and Typescript, and is very
  much like a table in a relational database.
- field :: A field within /one/ type contains one or more pieces of
  data that validly conform to /another/ type, thus establishing
  /relationships/ among types.  A GraphQL field is very much like a
  property of a user-defined type in a programming language, and is
  very much like a column in a relational database.  Relationships
  between GraphQL types are very much like pointers or references in
  programming languages, and are very much like foreign key
  constraints in relational databases.

There's more to GraphQL, but that's pretty much the essence.  Note the
similarities between concepts in GraphQL and in programming languages,
and especially between concepts in GraphQL and in relational
databases.  That will be important [[*Is this the /Only/ way to build a GraphQL API server?][later]].

OK, that's enough for now about what GraphQL /is/, but what is GraphQL
/for/?  Why should we consider GraphQL, especially as an alternative
to REST?  I listed above some of GraphQL's improvements over typical
REST--expressivity, efficiency, discoverability, simplicity--but
another perhaps more concise way to put it is this:

#+begin_quote
GraphQL's expressivity, efficiency, discoverability, and simplicity
make life easier for data consumers.
#+end_quote

However, there's a corollary:

#+begin_quote
GraphQL's expressivity, efficiency, discoverability, and simplicity
make life harder for data producers.
#+end_quote

That's /you/!  If you're a Java programmer working with GraphQL, your
job is probably to /produce/ GraphQL API servers for clients to
/consume/ (there are relatively few--not "none", but "few"--settings
for Java on the client).  Offering all that expressivity,
discoverability, etc. ain't easy, so how do you do it?

