docs/articles/ultimate_guide_for_graphql_with_java.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GraphQL and Java</title>
<meta name="author" content="David A. Ventimiglia" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/kimeiga/bahunya/dist/bahunya.min.css">
<!--<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/tufte-css@1.8.0/tufte.min.css">-->
<!--<link rel="stylesheet" href="https://fonts.xz.style/serve/inter.css">-->
<!--<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/@exampledev/new.css@1.1.2/new.min.css">-->

</head>
<body>

<nav>
 <a accesskey="H" href="/index.html"> HOME </a>
</nav>
<div id="preamble" class="status">

<header>
  <h1 class="title">David A. Ventimiglia</h1>
</header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">GraphQL and Java</h1>
<p class="subtitle" role="doc-subtitle">The Agony and the Ecstasy</p>
</header>
<div id="outline-container-org44089c0" class="outline-2">
<h2 id="org44089c0">What is GraphQL and why do people want it?</h2>
<div class="outline-text-2" id="text-org44089c0">
<p>
GraphQL is an important evolution in the design of Application
Performance Interfaces (API), but even today it can be difficult to
know how to get started with GraphQL, how to move beyond "Getting
Started" with GraphQL, and how to move beyond the conventional wisdom
on GraphQL.  This is especially true for Java.  This guide attempts to
cover all these bases in three steps.  First, I'll tell you what
GraphQL is, and as a bonus I'll tell you what GraphQL <i>really</i> is.
Second, I'll show you how to implement state-of-the-art GraphQL in
Java for a real application.  Third, I'll offer you an alternative
path beyond the state-of-the-art that may suit your needs better in
every dimension.  And, if you feel like skipping to <a href="#orge86cd9c">the end</a>, who am I
to stop you?  It certainly will save a great deal of effort.
</p>

<p>
So, what <i>is</i> GraphQL?  Well, GraphQL.org <a href="https://graphql.org/learn/">says</a>
</p>

<blockquote>
<p>
GraphQL is a query language for your API, and a server-side runtime
for executing queries using a type system you define for your
data. GraphQL isn’t tied to any specific database or storage engine
and is instead backed by your existing code and data.
</p>
</blockquote>

<p>
That's not wrong, but let me take a few more runs at it from different
directions.  Sure, GraphQL <i>is</i> "a query language for your API", but
you might as well just say that it <i>is</i> an API, or a way of building
an API.  That puts it in contrast with <a href="https://htmx.org/essays/rest-explained/">REST</a>, which GraphQL is an
evolution from and an alternative to.  GraphQL offers several
improvements over REST (or at least, the <a href="https://en.wikipedia.org/wiki/Richardson_Maturity_Model#Level_2:_HTTP_verbs">way</a> that REST is usually
done):
</p>

<dl class="org-dl">
<dt>expressivity</dt><dd>A client can say exactly what data they need from a
server, no more and no less.</dd>
<dt>efficiency</dt><dd>Expressivity leads to efficiency gains, reducing
network chatter and wasted bandwidth.</dd>
<dt>discoverability</dt><dd>In order to know what to say to a server, a
client needs to know what <i>can</i> be said to a server.  That's where
discoverability comes in, allowing data consumers to know exactly
what's available from data producers.</dd>
<dt>simplicity</dt><dd>GraphQL puts clients in the driver's seat, so there
had better be some good ergonomics for driving.  GraphQL's
highly-regular machine-readable syntax, simple execution model, and
simple <a href="https://spec.graphql.org/">specification</a> lend themselves to inter-operable and composable
tools:
<ul class="org-ul">
<li><a href="https://altairgraphql.dev/">query</a> <a href="https://github.com/graphql/graphiql/tree/main/packages/graphiql#readme">tools</a></li>
<li><a href="https://the-guild.dev/graphql/hive">schema registries</a></li>
<li><a href="https://the-guild.dev/graphql/mesh">gateways</a></li>
<li><a href="https://the-guild.dev/graphql/codegen">code generators</a></li>
<li><a href="https://commerce.nearform.com/open-source/urql/">client</a> <a href="https://www.apollographql.com/docs/react/">libraries</a></li>
</ul></dd>
</dl>

<p>
But, what <i>else</i> is GraphQL.  What <i>really</i> is GraphQL?  GraphQL is
<i>also</i> a data model for its query language and, despite the name,
neither the query language nor the data model are very "graphy."  The
data model is <a href="https://spec.graphql.org/October2021/#sec-JSON-Serialization">essentially</a> just JSON.  The query language <i>looks</i> like
JSON and can be boiled down to a few simple features:
</p>

<dl class="org-dl">
<dt>types</dt><dd>A <a href="https://spec.graphql.org/October2021/#sec-Types">type</a> is a simple value (a <a href="https://spec.graphql.org/October2021/#sec-Scalars">scalar</a>) or a set of fields (an
<a href="https://spec.graphql.org/October2021/#sec-Objects">object</a>).  While you naturally introduce new types for your own
problem domain, there are few special types (called <a href="https://spec.graphql.org/October2021/#sec-Language.Operations">Operations</a>).
One of theses is <a href="https://spec.graphql.org/October2021/#sec-Query">Query</a>, which is the root of requests for data
(setting aside <a href="https://spec.graphql.org/October2021/#sec-Subscription">Subscription</a> for now, for the sake of simplicity).  A
type essentially is a set of rules for determining if a piece of
data&#x2013;or a request for that piece of data&#x2013;validly conforms to the
given type.  A GraphQL type is very much like a user-defined type in
programming languages like C++, Java, and Typescript, and is very
much like a table in a relational database.</dd>
<dt>field</dt><dd>A field within <i>one</i> type contains one or more pieces of
data that validly conform to <i>another</i> type, thus establishing
<i>relationships</i> among types.  A GraphQL field is very much like a
property of a user-defined type in a programming language, and is
very much like a column in a relational database.  Relationships
between GraphQL types are very much like pointers or references in
programming languages, and are very much like foreign key
constraints in relational databases.</dd>
</dl>

<p>
There's more to GraphQL, but that's pretty much the essence.  Note the
similarities between concepts in GraphQL and in programming languages,
and especially between concepts in GraphQL and in relational
databases.  That will be important <a href="#orgd3e9d19">later</a>.
</p>

<p>
OK, that's enough for now about what GraphQL <i>is</i>, but what is GraphQL
<i>for</i>?  Why should we consider GraphQL, especially as an alternative
to REST?  I listed above some of GraphQL's improvements over typical
REST&#x2013;expressivity, efficiency, discoverability, simplicity&#x2013;but
another perhaps more concise way to put it is this:
</p>

<blockquote>
<p>
GraphQL's expressivity, efficiency, discoverability, and simplicity
make life easier for data consumers.
</p>
</blockquote>

<p>
However, there's a corollary:
</p>

<blockquote>
<p>
GraphQL's expressivity, efficiency, discoverability, and simplicity
make life harder for data producers.
</p>
</blockquote>

<p>
That's <i>you</i>!  If you're a Java programmer working with GraphQL, your
job is probably to <i>produce</i> GraphQL API servers for clients to
<i>consume</i> (there are relatively few&#x2013;not "none", but "few"&#x2013;settings
for Java on the client).  Offering all that expressivity,
discoverability, etc. ain't easy, so how do you do it?
</p>
</div>
</div>
