articles/ultimate_guide_for_graphql_with_java.org
* How do I provide the GraphQL that people want, especially as a Java developer?

On the journey to providing a GraphQL API we confront a series
interdependent choices, which /can/ make life easier (or harder) for
data producers.  One choice is over just /how/ "expressive, efficient,
discoverable, and simple" is our API, but let's set that aside for a
moment and treat that as an emergent property of the other choices we
make.  Life is about trade-offs, after all.

Another choice is over [[https://www.thoughtworks.com/content/dam/thoughtworks/documents/e-book/tw_ebook_build_vs_buy_2022.pdf][build-versus-buy [PDF]​]], but let's also set that
aside for a moment, accept that we're building a GraphQL API server
(in Java), explore how that is done, and evaluate the consequences.

If we're building a GraphQL API server in Java, another choice is over
whether to build it completely from scratch or to use libraries and
frameworks, and if the latter then which libraries and frameworks to
use.  Let's set /that/ aside, rightfully regard a complete [[https://en.wikipedia.org/wiki/Do_it_yourself][DIY]]
solution as pointless masochism, and survey the landscape of Java
libraries and frameworks for GraphQL.  As of writing (April 2024)
there are three important interdependent players in this space:

- graphql-java :: [[https://www.graphql-java.com/][graphql-java]] is a lower-level foundational library
  for working with GraphQL in Java, which began in 2015.  Since the
  other players depend on and use graphql-java, consider graphql-java
  to be /non-optional/.  Another crucial choice is whether you are or
  are not using the [[https://spring.io/projects/spring-boot][Spring Boot]] framework.  If you're /not/ using
  Spring Boot then /stop here!/ 🛑 Since this is a prerequisite, in
  the parlance of the [[https://www.thoughtworks.com/radar][ThoughtWorks Radar]] this is unavoidably *Adopt*.
- Netflix DGS :: [[https://netflix.github.io/dgs/][DGS]] is a higher-level library for working with
  GraphQL in Java /with Spring Boot/, which began in 2021.  If you're
  using DGS then you /will/ also be using graphql-java under-the-hood,
  but typically you won't come into contact with graphql-java.
  Instead, you will be sprinkling [[https://en.wikipedia.org/wiki/Java_annotation][annotations]] throughout the Java code
  to identify the code segments (called "resolvers" or "data
  fetchers"...more on that [[*Is this the /Only/ way to build a GraphQL API server?][later]]) that execute GraphQL requests.
  Thoughtworks [[https://www.thoughtworks.com/radar/languages-and-frameworks/netflix-dgs][said]] *Trial* as of 2023 for DGS but this is a dynamic
  space and their opinion may have changed.  I say *Hold*, for reasons
  given below.
- Spring for GraphQL :: [[https://spring.io/projects/spring-graphql][Spring for GraphQL]] is /another/ higher-level
  library for working with GraphQL in Java with Spring Boot, which
  began around 2023, and is also based on annotations.  It may be too
  new for ThoughtWorks, but it's not too new for me.  I say *adopt*,
  and read on for why.

The makers of Spring for GraphQL [[https://spring.io/projects/spring-graphql][say]]:

#+begin_quote
It is a joint collaboration between the GraphQL Java team and Spring
engineering...It aims to be the foundation for all Spring, GraphQL
applications.
#+end_quote

Translation:

#+begin_quote
The Spring team has a privileged collaboration with the makers of the
foundational library for GraphQL in Java, and intends to "win" in this
space.
#+end_quote

Moreover, the makers of Netflix DGS have much to [[https://netflix.github.io/dgs/spring-graphql-integration/][say]] on the subject of
that library's relationship to Spring for GraphQL.

#+begin_quote
Soon after we open-sourced the DGS framework, we learned about
parallel efforts by the Spring team to develop a GraphQL framework for
Spring Boot. The Spring GraphQL project was in the early stages at the
time and provided a low-level of integration with graphql-java. Over
the past year, however, Spring GraphQL has matured and is mostly at
feature parity with the DGS Framework. We now have 2 competing
frameworks that solve the same problems for our users.

Today, new users must choose between the DGS Framework or Spring
GraphQL, thus missing out on features available in one framework but
not the other. This is not an ideal situation for the GraphQL Java
community.

For the maintainers of DGS and Spring GraphQL, it would be far more
effective to collaborate on features and improvements instead of
having to solve the same problem independently. Finally, a unified
community would provide us with better channels for feedback.

The DGS framework is widely used and plays a vital role in the
architecture of many companies, including Netflix. Moving away from
the framework in favor of Spring-GraphQL would be a costly migration
without any real benefits.

From a Spring Framework perspective, it makes sense to have an
out-of-the-box GraphQL offering, just like Spring supports REST.
#+end_quote

Translation:

#+begin_quote
If you're a Spring Boot shop already using DGS, go ahead and keep
using it for now.  If you're a Spring Boot shop starting afresh, you
should probably just use Spring for GraphQL.
#+end_quote

In this guide I've told you what GraphQL /is/.  I've told you what
GraphQL /really/ is.  I've set the stage by giving some background on
the relevant libraries and frameworks in Java.  Now, let me show you
how to implement state-of-the-art GraphQL in Java for a real
application, and since we're starting afresh we'll take the advice
from DGS and just use Spring for GraphQL.

