docs/articles/ultimate_guide_for_graphql_with_java.html

<div id="outline-container-org70292c2" class="outline-2">
<h2 id="org70292c2">How do I provide the GraphQL that people want, especially as a Java developer?</h2>
<div class="outline-text-2" id="text-org70292c2">
<p>
On the journey to providing a GraphQL API we confront a series
interdependent choices, which <i>can</i> make life easier (or harder) for
data producers.  One choice is over just <i>how</i> "expressive, efficient,
discoverable, and simple" is our API, but let's set that aside for a
moment and treat that as an emergent property of the other choices we
make.  Life is about trade-offs, after all.
</p>

<p>
Another choice is over <a href="https://www.thoughtworks.com/content/dam/thoughtworks/documents/e-book/tw_ebook_build_vs_buy_2022.pdf">build-versus-buy [PDF]​</a>, but let's also set that
aside for a moment, accept that we're building a GraphQL API server
(in Java), explore how that is done, and evaluate the consequences.
</p>

<p>
If we're building a GraphQL API server in Java, another choice is over
whether to build it completely from scratch or to use libraries and
frameworks, and if the latter then which libraries and frameworks to
use.  Let's set <i>that</i> aside, rightfully regard a complete <a href="https://en.wikipedia.org/wiki/Do_it_yourself">DIY</a>
solution as pointless masochism, and survey the landscape of Java
libraries and frameworks for GraphQL.  As of writing (April 2024)
there are three important interdependent players in this space:
</p>

<dl class="org-dl">
<dt>graphql-java</dt><dd><a href="https://www.graphql-java.com/">graphql-java</a> is a lower-level foundational library
for working with GraphQL in Java, which began in 2015.  Since the
other players depend on and use graphql-java, consider graphql-java
to be <i>non-optional</i>.  Another crucial choice is whether you are or
are not using the <a href="https://spring.io/projects/spring-boot">Spring Boot</a> framework.  If you're <i>not</i> using
Spring Boot then <i>stop here!</i> 🛑 Since this is a prerequisite, in
the parlance of the <a href="https://www.thoughtworks.com/radar">ThoughtWorks Radar</a> this is unavoidably <b>Adopt</b>.</dd>
<dt>Netflix DGS</dt><dd><a href="https://netflix.github.io/dgs/">DGS</a> is a higher-level library for working with
GraphQL in Java <i>with Spring Boot</i>, which began in 2021.  If you're
using DGS then you <i>will</i> also be using graphql-java under-the-hood,
but typically you won't come into contact with graphql-java.
Instead, you will be sprinkling <a href="https://en.wikipedia.org/wiki/Java_annotation">annotations</a> throughout the Java code
to identify the code segments (called "resolvers" or "data
fetchers"&#x2026;more on that <a href="#orgd3e9d19">later</a>) that execute GraphQL requests.
Thoughtworks <a href="https://www.thoughtworks.com/radar/languages-and-frameworks/netflix-dgs">said</a> <b>Trial</b> as of 2023 for DGS but this is a dynamic
space and their opinion may have changed.  I say <b>Hold</b>, for reasons
given below.</dd>
<dt>Spring for GraphQL</dt><dd><a href="https://spring.io/projects/spring-graphql">Spring for GraphQL</a> is <i>another</i> higher-level
library for working with GraphQL in Java with Spring Boot, which
began around 2023, and is also based on annotations.  It may be too
new for ThoughtWorks, but it's not too new for me.  I say <b>adopt</b>,
and read on for why.</dd>
</dl>

<p>
The makers of Spring for GraphQL <a href="https://spring.io/projects/spring-graphql">say</a>:
</p>

<blockquote>
<p>
It is a joint collaboration between the GraphQL Java team and Spring
engineering&#x2026;It aims to be the foundation for all Spring, GraphQL
applications.
</p>
</blockquote>

<p>
Translation:
</p>

<blockquote>
<p>
The Spring team has a privileged collaboration with the makers of the
foundational library for GraphQL in Java, and intends to "win" in this
space.
</p>
</blockquote>

<p>
Moreover, the makers of Netflix DGS have much to <a href="https://netflix.github.io/dgs/spring-graphql-integration/">say</a> on the subject of
that library's relationship to Spring for GraphQL.
</p>

<blockquote>
<p>
Soon after we open-sourced the DGS framework, we learned about
parallel efforts by the Spring team to develop a GraphQL framework for
Spring Boot. The Spring GraphQL project was in the early stages at the
time and provided a low-level of integration with graphql-java. Over
the past year, however, Spring GraphQL has matured and is mostly at
feature parity with the DGS Framework. We now have 2 competing
frameworks that solve the same problems for our users.
</p>

<p>
Today, new users must choose between the DGS Framework or Spring
GraphQL, thus missing out on features available in one framework but
not the other. This is not an ideal situation for the GraphQL Java
community.
</p>

<p>
For the maintainers of DGS and Spring GraphQL, it would be far more
effective to collaborate on features and improvements instead of
having to solve the same problem independently. Finally, a unified
community would provide us with better channels for feedback.
</p>

<p>
The DGS framework is widely used and plays a vital role in the
architecture of many companies, including Netflix. Moving away from
the framework in favor of Spring-GraphQL would be a costly migration
without any real benefits.
</p>

<p>
From a Spring Framework perspective, it makes sense to have an
out-of-the-box GraphQL offering, just like Spring supports REST.
</p>
</blockquote>

<p>
Translation:
</p>

<blockquote>
<p>
If you're a Spring Boot shop already using DGS, go ahead and keep
using it for now.  If you're a Spring Boot shop starting afresh, you
should probably just use Spring for GraphQL.
</p>
</blockquote>

<p>
In this guide I've told you what GraphQL <i>is</i>.  I've told you what
GraphQL <i>really</i> is.  I've set the stage by giving some background on
the relevant libraries and frameworks in Java.  Now, let me show you
how to implement state-of-the-art GraphQL in Java for a real
application, and since we're starting afresh we'll take the advice
from DGS and just use Spring for GraphQL.
</p>
</div>
</div>
