articles/ultimate_guide_for_graphql_with_java.org
* How exactly do I build a GraphQL API server in Java for a real application?

Opinions are free to differ on what it even means to be a "real
application."  For the purpose of this guide, what /I/ mean by "real
application" in this settings is an application that has at least
these features:

- persistence :: Many [[https://www.graphql-java.com/tutorials/getting-started-with-spring-boot][tutorials]], [[https://netflix.github.io/dgs/][getting-started guides]], and [[https://docs.spring.io/spring-graphql/reference/][overviews]]
  only address in-memory data models, stopping well short of
  interacting with a database.  This guide shows you /some/ ways to
  cross this crucial chasm and discusses /some/ of the consequences,
  challenges, and trade-offs involved.  This is a vast topic so I
  barely scratch the surface, but it's a start.  The primary goal is
  to support ~Query~ operations.  A stretch goal is to support
  ~Mutation~ operations.  ~Subscription~ operations are thoroughly
  off-the-table for now.
- flexibility :: I wrote above that just /how/ expressive, efficient,
  discoverable, and simple we make our GraphQL API is technically a
  choice we make, but is practically a property that emerges from other
  choices we make.  I also wrote that building GraphQL API servers is
  difficult for data producers.  Consequently, many data producers
  cope with that difficulty by dialing way back on those other
  properties of the API.  Many GraphQL API servers in the real world
  are inflexible, are superficial, are shallow, and are in many ways
  "GraphQL-in-name-only."  This guide shows /some/ of what's involved
  in going beyond the /status quo/ and how that comes into tension
  with other properties, like efficiency.  *Spoiler Alert*:  It isn't
  pretty.
- efficiency :: In fairness, many GraphQL API servers in the real
  world achieve decent efficiency, albeit at the expense of
  flexibility, by essentially encoding REST API endpoints into a
  shallow GraphQL schema.  The standard approach in GraphQL is the
  [[https://www.graphql-java.com/documentation/batching/][data-loader pattern]], but few tutorials really show how this is used
  even with an in-memory data model let alone with a database.  This
  guide offers one implementation of the data loader pattern to combat
  the N+1 problem.  Again, we see how that comes into tension with
  flexibility and simplicity.
- modernity :: Anyone writing a Java application that accesses a
  database will have to make choices about /how/ to access a database.
  That could involve just [[https://en.wikipedia.org/wiki/Java_Database_Connectivity][JDBC]] and raw SQL (for a relational database)
  but arguably the current industry standard is still to use an
  Object-Relational Mapping ([[https://web.archive.org/web/20220823105749/http://blogs.tedneward.com/post/the-vietnam-of-computer-science/][ORM]]) layer like [[https://hibernate.org/orm/][Hibernate]], [[https://www.jooq.org/][jooq]], or the
  standard [[https://docs.oracle.com/javaee/6/tutorial/doc/bnbpz.html][JPA]].  Getting an ORM to play nice with GraphQL is a tall
  order, may not be prudent, and may not even be possible.  Few if any
  other guides touch this with a ten-foot-pole.  This guide at least
  +makes an attemp+ /will make an attempt with an ORM in the future!/

The recipe I follow in this guide for building a GraphQL API server in
Java /for a relational database/ is the following:

1. Choose [[https://spring.io/projects/spring-boot][Spring Boot]] for the overall server framework.
2. Choose [[https://spring.io/projects/spring-graphql][Spring for GraphQL]] for the GraphQL-specific parts.
3. Choose [[https://spring.io/projects/spring-data-jdbc][Spring Data for JDBC]] for data access in lieu of an ORM /for
   now/.
4. Choose [[https://maven.apache.org/][Maven]] over [[https://gradle.org/][Gradle]] because I prefer the former.  If you
   choose the latter, you're on your own.
5. Choose [[https://www.postgresql.org/][PostgreSQL]] for the database.  Most of the principles should
   apply for pretty much any relational database, but you've got to
   start somewhere.
6. Choose [[https://docs.docker.com/compose/][Docker Compose]] for orchestrating a development database
   server.  There are [[https://testcontainers.com/][other]] ways of bringing in a database, but again,
   you've got to start somewhere.
7. Choose the [[https://docs.yugabyte.com/preview/sample-data/chinook][Chinook]] data model.  Naturally, you will have your own
   data model, but Chinook is a good choice for illustration purposes
   because it's fairly rich, has quite a few tables and relationships,
   goes well beyond the ubiquitous but trivial [[https://todomvc.com/][To-Do]] apps, is
   available for a wide variety of databases, and is generally
   well-understood.
8. Choose the [[https://netflix.github.io/dgs/#create-a-new-spring-boot-application][Spring Initializr]] for bootstrapping the application.
   There's so much ceremony in Java, any way to race through some of
   it is welcomed.
9. [[https://netflix.github.io/dgs/#creating-a-schema][Create]] a GraphQL schema file.  This is a necessary step for
   graphql-java, for DGS, and for Spring for GraphQL.  Weirdly, the
   Spring for GraphQL overview seems to overlook this step, but the
   DGS "Getting Started" guide is there to remind us.  Many "thought
   leaders" will exhort you to isolate your underlying data model from
   your API.  Theoretically, you could do this by having different
   GraphQL types from your database tables.  Practically, this is a
   source of busy-work.
10. Write Java model classes, one for every GraphQL type in the schema
    file and every table in the database.  You're free to make other
    choices for this data model or for any other data model, and you
    can even write code or SQL views to isolate your underlying data
    model from your API, but do ask how important this really is when
    the number of tables/classes/types grows to the hundreds or
    thousands.
11. Write Java controller classes, with one method at least for every
    [[https://www.apollographql.com/tutorials/fullstack-quickstart/04-writing-query-resolvers][root field]].  In practice, this is the bare minimum.  There
    probably will be many more.  By the way, these methods /are/ your
    "resolvers".
12. Annotate every controller class with ~@Controller~ to tell Spring
    to inject it as a Java Bean that can serve network traffic.
13. Annotate every resolver/data-fetcher method with ~@SchemaMapping~
    or ~QueryMapping~ to tell Spring for GraphQL how to execute the
    parts of a GraphQL operation.
14. Implement those resolver/data-fetcher methods /by whatever means
    necessary/ to mediate interactions with the database.  In version
    0, this will be just simple raw SQL statements.
15. Upgrade /some/ of those resolver/data-fetcher methods by replacing
    ~@SchemaMapping~ or ~@QueryMapping~ with ~@BatchMapping~.  This
    latter annotation signals to Spring for GraphQL that we want make
    the execution more efficient by combating the N+1 problem, and
    we're prepared to pay the price in more code in order do do it.
16. Refactor those ~@BatchMapping~-annotated methods to support the
    data loader pattern, by accepting (and processing) a /list/ of
    identifiers for related entities, rather than a single identifier
    for a single related entity.
17. +Write copious test-cases for every possible interaction.+
18. Just use a [[https://github.com/EMResearch/EvoMaster][fuzz-tester]] on the API and call it a day.

