docs/articles/ultimate_guide_for_graphql_with_java.html

<div id="outline-container-orgcd0f7b5" class="outline-2">
<h2 id="orgcd0f7b5">How exactly do I build a GraphQL API server in Java for a real application?</h2>
<div class="outline-text-2" id="text-orgcd0f7b5">
<p>
Opinions are free to differ on what it even means to be a "real
application."  For the purpose of this guide, what <i>I</i> mean by "real
application" in this settings is an application that has at least
these features:
</p>

<dl class="org-dl">
<dt>persistence</dt><dd>Many <a href="https://www.graphql-java.com/tutorials/getting-started-with-spring-boot">tutorials</a>, <a href="https://netflix.github.io/dgs/">getting-started guides</a>, and <a href="https://docs.spring.io/spring-graphql/reference/">overviews</a>
only address in-memory data models, stopping well short of
interacting with a database.  This guide shows you <i>some</i> ways to
cross this crucial chasm and discusses <i>some</i> of the consequences,
challenges, and trade-offs involved.  This is a vast topic so I
barely scratch the surface, but it's a start.  The primary goal is
to support <code>Query</code> operations.  A stretch goal is to support
<code>Mutation</code> operations.  <code>Subscription</code> operations are thoroughly
off-the-table for now.</dd>
<dt>flexibility</dt><dd>I wrote above that just <i>how</i> expressive, efficient,
discoverable, and simple we make our GraphQL API is technically a
choice we make, but is practically a property that emerges from other
choices we make.  I also wrote that building GraphQL API servers is
difficult for data producers.  Consequently, many data producers
cope with that difficulty by dialing way back on those other
properties of the API.  Many GraphQL API servers in the real world
are inflexible, are superficial, are shallow, and are in many ways
"GraphQL-in-name-only."  This guide shows <i>some</i> of what's involved
in going beyond the <i>status quo</i> and how that comes into tension
with other properties, like efficiency.  <b>Spoiler Alert</b>:  It isn't
pretty.</dd>
<dt>efficiency</dt><dd>In fairness, many GraphQL API servers in the real
world achieve decent efficiency, albeit at the expense of
flexibility, by essentially encoding REST API endpoints into a
shallow GraphQL schema.  The standard approach in GraphQL is the
<a href="https://www.graphql-java.com/documentation/batching/">data-loader pattern</a>, but few tutorials really show how this is used
even with an in-memory data model let alone with a database.  This
guide offers one implementation of the data loader pattern to combat
the N+1 problem.  Again, we see how that comes into tension with
flexibility and simplicity.</dd>
<dt>modernity</dt><dd>Anyone writing a Java application that accesses a
database will have to make choices about <i>how</i> to access a database.
That could involve just <a href="https://en.wikipedia.org/wiki/Java_Database_Connectivity">JDBC</a> and raw SQL (for a relational database)
but arguably the current industry standard is still to use an
Object-Relational Mapping (<a href="https://web.archive.org/web/20220823105749/http://blogs.tedneward.com/post/the-vietnam-of-computer-science/">ORM</a>) layer like <a href="https://hibernate.org/orm/">Hibernate</a>, <a href="https://www.jooq.org/">jooq</a>, or the
standard <a href="https://docs.oracle.com/javaee/6/tutorial/doc/bnbpz.html">JPA</a>.  Getting an ORM to play nice with GraphQL is a tall
order, may not be prudent, and may not even be possible.  Few if any
other guides touch this with a ten-foot-pole.  This guide at least
<del>makes an attemp</del> <i>will make an attempt with an ORM in the future!</i></dd>
</dl>

<p>
The recipe I follow in this guide for building a GraphQL API server in
Java <i>for a relational database</i> is the following:
</p>

<ol class="org-ol">
<li>Choose <a href="https://spring.io/projects/spring-boot">Spring Boot</a> for the overall server framework.</li>
<li>Choose <a href="https://spring.io/projects/spring-graphql">Spring for GraphQL</a> for the GraphQL-specific parts.</li>
<li>Choose <a href="https://spring.io/projects/spring-data-jdbc">Spring Data for JDBC</a> for data access in lieu of an ORM <i>for
now</i>.</li>
<li>Choose <a href="https://maven.apache.org/">Maven</a> over <a href="https://gradle.org/">Gradle</a> because I prefer the former.  If you
choose the latter, you're on your own.</li>
<li>Choose <a href="https://www.postgresql.org/">PostgreSQL</a> for the database.  Most of the principles should
apply for pretty much any relational database, but you've got to
start somewhere.</li>
<li>Choose <a href="https://docs.docker.com/compose/">Docker Compose</a> for orchestrating a development database
server.  There are <a href="https://testcontainers.com/">other</a> ways of bringing in a database, but again,
you've got to start somewhere.</li>
<li>Choose the <a href="https://docs.yugabyte.com/preview/sample-data/chinook">Chinook</a> data model.  Naturally, you will have your own
data model, but Chinook is a good choice for illustration purposes
because it's fairly rich, has quite a few tables and relationships,
goes well beyond the ubiquitous but trivial <a href="https://todomvc.com/">To-Do</a> apps, is
available for a wide variety of databases, and is generally
well-understood.</li>
<li>Choose the <a href="https://netflix.github.io/dgs/#create-a-new-spring-boot-application">Spring Initializr</a> for bootstrapping the application.
There's so much ceremony in Java, any way to race through some of
it is welcomed.</li>
<li><a href="https://netflix.github.io/dgs/#creating-a-schema">Create</a> a GraphQL schema file.  This is a necessary step for
graphql-java, for DGS, and for Spring for GraphQL.  Weirdly, the
Spring for GraphQL overview seems to overlook this step, but the
DGS "Getting Started" guide is there to remind us.  Many "thought
leaders" will exhort you to isolate your underlying data model from
your API.  Theoretically, you could do this by having different
GraphQL types from your database tables.  Practically, this is a
source of busy-work.</li>
<li>Write Java model classes, one for every GraphQL type in the schema
file and every table in the database.  You're free to make other
choices for this data model or for any other data model, and you
can even write code or SQL views to isolate your underlying data
model from your API, but do ask how important this really is when
the number of tables/classes/types grows to the hundreds or
thousands.</li>
<li>Write Java controller classes, with one method at least for every
<a href="https://www.apollographql.com/tutorials/fullstack-quickstart/04-writing-query-resolvers">root field</a>.  In practice, this is the bare minimum.  There
probably will be many more.  By the way, these methods <i>are</i> your
"resolvers".</li>
<li>Annotate every controller class with <code>@Controller</code> to tell Spring
to inject it as a Java Bean that can serve network traffic.</li>
<li>Annotate every resolver/data-fetcher method with <code>@SchemaMapping</code>
or <code>QueryMapping</code> to tell Spring for GraphQL how to execute the
parts of a GraphQL operation.</li>
<li>Implement those resolver/data-fetcher methods <i>by whatever means
necessary</i> to mediate interactions with the database.  In version
0, this will be just simple raw SQL statements.</li>
<li>Upgrade <i>some</i> of those resolver/data-fetcher methods by replacing
<code>@SchemaMapping</code> or <code>@QueryMapping</code> with <code>@BatchMapping</code>.  This
latter annotation signals to Spring for GraphQL that we want make
the execution more efficient by combating the N+1 problem, and
we're prepared to pay the price in more code in order do do it.</li>
<li>Refactor those <code>@BatchMapping</code>-annotated methods to support the
data loader pattern, by accepting (and processing) a <i>list</i> of
identifiers for related entities, rather than a single identifier
for a single related entity.</li>
<li><del>Write copious test-cases for every possible interaction.</del></li>
<li>Just use a <a href="https://github.com/EMResearch/EvoMaster">fuzz-tester</a> on the API and call it a day.</li>
</ol>
</div>
</div>
