articles/ultimate_guide_for_graphql_with_java.org
* No, but really, how exactly do I build a GraphQL API server in Java for a real application?

That is a /long recipe/ above!  Instead of going into
chapter-and-verse for every single step, in this guide I do two
things.  First, I provide a public [[https://github.com/dventimihasura/graphql-with-java][repository]] with working code that
is easy to use, easy to run, easy to read, and easy to understand.  If
you feel it falls short in any of these objects /please do let me
know!/  Second, I highlight /some/ of the important steps, put them in
context, discuss the choices involved, and offer some alternatives.

** Step 6:  Choose [[https://docs.docker.com/compose/][Docker Compose]] for orchestrating a development database server.

Again, there are other ways to pull this off, but this is one good
way.

#+begin_src yaml
version: "3.6"
services:
  postgres:
    image: postgres:16
    ports:
      - ${PGPORT:-5432}:5432
    restart: always
    environment:
      POSTGRES_PASSWORD: postgres
      PGDATA: /var/lib/pgdata
    volumes:
      - ./initdb.d-postgres:/docker-entrypoint-initdb.d:ro
      - type: tmpfs
        target: /var/lib/pg/data
#+end_src

Set an environment variable for ~PGPORT~ to expose PostgreSQL on a
host port, or hard-code it to whatever value you like.

Start the server with:

** Step 7:  Choose the [[https://www.yugabyte.com/blog/postgresql-how-to-installing-the-chinook-sample-db-on-a-distributed-sql-database/][Chinook]] data model.

The Chinook files from [[https://www.yugabyte.com/blog/postgresql-how-to-installing-the-chinook-sample-db-on-a-distributed-sql-database/][YugaByte]] work out-of-the-box for PostgreSQL and
are a good choice.  Just make sure that there is a sub-directory
~initdb.d-postgres~ and download the Chinook DDL and DML files into
that directory, taking care to give them numeric prefixes so that
they're run by the PostgreSQL initialization script in the proper
order.

#+begin_src shell :exports both
  mkdir -p ./initdb.d-postgres
  wget -O ./initdb.d-postgres/04_chinook_ddl.sql
  wget -O ./initdb.d-postgres/05_chinook_genres_artists_albums.sql
  wget -O ./initdb.d-postgres/06_chinook_songs.sql
#+end_src

Now, you can start the database service using Docker Compose.

#+begin_src shell :exports both
  docker compose up -d
#+end_src

or

#+begin_src shell :exports both
  docker-compose up -d
#+end_src

There are many ways to spot check the validity of the database.  If
the Docker Compose service seems to have started correctly, here's one
way using ~psql~.

#+begin_src shell :results output :exports both
  psql "postgresql://postgres:postgres@localhost:5432/postgres" -c '\d'
#+end_src

#+RESULTS:
#+begin_example
              List of relations
 Schema |      Name       | Type  |  Owner   
--------+-----------------+-------+----------
 public | Album           | table | postgres
 public | Artist          | table | postgres
 public | Customer        | table | postgres
 public | Employee        | table | postgres
 public | Genre           | table | postgres
 public | Invoice         | table | postgres
 public | InvoiceLine     | table | postgres
 public | MediaType       | table | postgres
 public | Playlist        | table | postgres
 public | PlaylistTrack   | table | postgres
 public | Track           | table | postgres
 public | account         | table | postgres
 public | account_summary | view  | postgres
 public | order           | table | postgres
 public | order_detail    | table | postgres
 public | product         | table | postgres
 public | region          | table | postgres
(17 rows)

#+end_example

You should at least see Chinook-specific tables like ~Album~,
~Artist~, and ~Track~.

** Step 8:  Choose the [[https://start.spring.io/][Spring Initializr]] for bootstrapping the application.

The important things with this form are to make these choices:

- Project :: Maven
- Language :: Java
- Spring Boot :: 3.2.5
- Packaging :: Jar
- Java :: 21
- Dependencies ::
  - Spring for GraphQL
  - PostgreSQL Driver

You can make other choices (e.g. Gradle, Java 22, MySQL, etc.) but
bear in mind that this guide has only been tested with the choices
above.

