docs/articles/ultimate_guide_for_graphql_with_java.html

<div id="outline-container-org0dc6fb6" class="outline-2">
<h2 id="org0dc6fb6">No, but really, how exactly do I build a GraphQL API server in Java for a real application?</h2>
<div class="outline-text-2" id="text-org0dc6fb6">
<p>
That is a <i>long recipe</i> above!  Instead of going into
chapter-and-verse for every single step, in this guide I do two
things.  First, I provide a public <a href="https://github.com/dventimihasura/graphql-with-java">repository</a> with working code that
is easy to use, easy to run, easy to read, and easy to understand.  If
you feel it falls short in any of these objects <i>please do let me
know!</i>  Second, I highlight <i>some</i> of the important steps, put them in
context, discuss the choices involved, and offer some alternatives.
</p>
</div>

<div id="outline-container-orgca65f26" class="outline-3">
<h3 id="orgca65f26">Step 6:  Choose <a href="https://docs.docker.com/compose/">Docker Compose</a> for orchestrating a development database server.</h3>
<div class="outline-text-3" id="text-orgca65f26">
<p>
Again, there are other ways to pull this off, but this is one good
way.
</p>

<div class="org-src-container">
<pre class="src src-yaml">version: "3.6"
services:
  postgres:
    image: postgres:16
    ports:
      - ${PGPORT:-5432}:5432
    restart: always
    environment:
      POSTGRES_PASSWORD: postgres
      PGDATA: /var/lib/pgdata
    volumes:
      - ./initdb.d-postgres:/docker-entrypoint-initdb.d:ro
      - type: tmpfs
        target: /var/lib/pg/data
</pre>
</div>

<p>
Set an environment variable for <code>PGPORT</code> to expose PostgreSQL on a
host port, or hard-code it to whatever value you like.
</p>

<p>
Start the server with:
</p>
</div>
</div>

<div id="outline-container-orga304c23" class="outline-3">
<h3 id="orga304c23">Step 7:  Choose the <a href="https://www.yugabyte.com/blog/postgresql-how-to-installing-the-chinook-sample-db-on-a-distributed-sql-database/">Chinook</a> data model.</h3>
<div class="outline-text-3" id="text-orga304c23">
<p>
The Chinook files from <a href="https://www.yugabyte.com/blog/postgresql-how-to-installing-the-chinook-sample-db-on-a-distributed-sql-database/">YugaByte</a> work out-of-the-box for PostgreSQL and
are a good choice.  Just make sure that there is a sub-directory
<code>initdb.d-postgres</code> and download the Chinook DDL and DML files into
that directory, taking care to give them numeric prefixes so that
they're run by the PostgreSQL initialization script in the proper
order.
</p>

<div class="org-src-container">
<pre class="src src-shell">mkdir -p ./initdb.d-postgres
wget -O ./initdb.d-postgres/04_chinook_ddl.sql
wget -O ./initdb.d-postgres/05_chinook_genres_artists_albums.sql
wget -O ./initdb.d-postgres/06_chinook_songs.sql
</pre>
</div>

<p>
Now, you can start the database service using Docker Compose.
</p>

<div class="org-src-container">
<pre class="src src-shell">docker compose up -d
</pre>
</div>

<p>
or
</p>

<div class="org-src-container">
<pre class="src src-shell">docker-compose up -d
</pre>
</div>

<p>
There are many ways to spot check the validity of the database.  If
the Docker Compose service seems to have started correctly, here's one
way using <code>psql</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell">psql "postgresql://postgres:postgres@localhost:5432/postgres" -c '\d'
</pre>
</div>

<pre class="example" id="org6490617">
              List of relations
 Schema |      Name       | Type  |  Owner   
--------+-----------------+-------+----------
 public | Album           | table | postgres
 public | Artist          | table | postgres
 public | Customer        | table | postgres
 public | Employee        | table | postgres
 public | Genre           | table | postgres
 public | Invoice         | table | postgres
 public | InvoiceLine     | table | postgres
 public | MediaType       | table | postgres
 public | Playlist        | table | postgres
 public | PlaylistTrack   | table | postgres
 public | Track           | table | postgres
 public | account         | table | postgres
 public | account_summary | view  | postgres
 public | order           | table | postgres
 public | order_detail    | table | postgres
 public | product         | table | postgres
 public | region          | table | postgres
(17 rows)

</pre>

<p>
You should at least see Chinook-specific tables like <code>Album</code>,
<code>Artist</code>, and <code>Track</code>.
</p>
</div>
</div>

<div id="outline-container-orge9244c1" class="outline-3">
<h3 id="orge9244c1">Step 8:  Choose the <a href="https://start.spring.io/">Spring Initializr</a> for bootstrapping the application.</h3>
<div class="outline-text-3" id="text-orge9244c1">
<p>
The important things with this form are to make these choices:
</p>

<dl class="org-dl">
<dt>Project</dt><dd>Maven</dd>
<dt>Language</dt><dd>Java</dd>
<dt>Spring Boot</dt><dd>3.2.5</dd>
<dt>Packaging</dt><dd>Jar</dd>
<dt>Java</dt><dd>21</dd>
<dt>Dependencies</dt><dd><ul class="org-ul">
<li>Spring for GraphQL</li>
<li>PostgreSQL Driver</li>
</ul></dd>
</dl>

<p>
You can make other choices (e.g. Gradle, Java 22, MySQL, etc.) but
bear in mind that this guide has only been tested with the choices
above.
</p>
</div>
</div>
