articles/ultimate_guide_for_graphql_with_java.org
** Step 9: [[https://netflix.github.io/dgs/#creating-a-schema][Create]] a GraphQL schema file.

Maven projects have a standard directory layout, and a standard place
within that layout for resource files to be packaged into the build
artifact (a JAR file) is ~./src/main/java/resources~.  Within that
directory, create a sub-directory ~graphql~ and deposit a
~schema.graphqls~ file.  There are other ways to organize the GraphQL
schema files needed by graphql-java, DGS, and Spring for GraphQL, but
they all are rooted in ~./src/main/java/resources~ (for a Maven
project).

Within the ~schema.graphqls~ file (or its equivalent), first there
will a definition for the root ~Query~ object, with root-level fields
for every GraphQL type that we want in our API.  As a starting point,
there will be a root-level field under ~Query~ for every table, and a
corresponding ~type~ for every table.  For example, for ~Query~:

#+begin_src graphql
type Query {
  Artist(limit: Int): [Artist]
  ArtistById(id: Int): Artist
  Album(limit: Int): [Album]
  AlbumById(id: Int): Album
  Track(limit: Int): [Track]
  TrackById(id: Int): Track
  Playlist(limit: Int): [Playlist]
  PlaylistById(id: Int): Playlist
  PlaylistTrack(limit: Int): [PlaylistTrack]
  PlaylistTrackById(id: Int): PlaylistTrack
  Genre(limit: Int): [Genre]
  GenreById(id: Int): Genre
  MediaType(limit: Int): [MediaType]
  MediaTypeById(id: Int): MediaType
  Customer(limit: Int): [Customer]
  CustoemrById(id: Int): Customer
  Employee(limit: Int): [Employee]
  EmployeeById(id: Int): Employee
  Invoice(limit: Int): [Invoice]
  InvoiceById(id: Int): Invoice
  InvoiceLine(limit: Int): [InvoiceLine]
  InvoiceLineById(id: Int): InvoiceLine
}
#+end_src

Note the parameters on these fields.  I have written it so that every
root-level field that has a [[https://spec.graphql.org/October2021/#sec-Wrapping-Types][List]] return type accepts one optional
~limit~ parameter which accepts an ~Int~.  The intention is to support
limiting the number of entries that should be returned from a
root-level field.  Note also that every root-level field that has a
[[https://spec.graphql.org/October2021/#ScalarTypeDefinition][Scalar]] object return type accepts one optional ~id~ parameter which
also accepts an ~Int~.  The intention is to support fetching a single
entry by its identifier (which happen all to be ~integer~ primary keys
in the Chinook data model).

Next, here is an illustration of /some/ of the corresponding GraphQL
types:

#+begin_src graphql
type Album {
  AlbumId  : Int
  Title    : String
  ArtistId : Int
  Artist   : Artist
  Tracks   : [Track]
}

type Artist {
  ArtistId: Int
  Name: String
  Albums: [Album]
}

type Customer {
  CustomerId   : Int
  FirstName    : String
  LastName     : String
  Company      : String
  Address      : String
  City         : String
  State        : String
  Country      : String
  PostalCode   : String
  Phone        : String
  Fax          : String
  Email        : String
  SupportRepId : Int
  SupportRep   : Employee
  Invoices     : [Invoice]
}
#+end_src

Fill out the rest of the ~schema.graphqls~ file as you see fit,
exposing whatever table (and possibly views, if you create them) you
like.  Or, just use the complete version from the shared repository.

** Step 10:  Write Java model classes.

Within the standard Maven directory layout, Java source code goes into
~./src/main/java~ and its sub-directories.  Within an appropriate
sub-directory for whatever Java package you use, create Java model
classes.  These can be Plain Old Java Objects ([[https://en.wikipedia.org/wiki/Plain_old_Java_object][POJOs]]).  They can be
Java [[https://docs.oracle.com/en/java/javase/17/language/records.html][Record]] classes.  They can be whatever you like, so long as they
have "getter" and "setter" property methods for the corresponding
fields in the GraphQL schema.  In this guide's repository, I choose
Java Record classes just for the minimal amount of boilerplate.

#+begin_src java
  package com.graphqljava.tutorial.retail.models;

  public class ChinookModels {
      public static
          record Album
          (
           Integer AlbumId,
           String Title,
           Integer ArtistId
           ) {}

      public static
          record Artist
          (
           Integer ArtistId,
           String Name
           ) {}

      public static
          record Customer
          (
           Integer CustomerId,
           String FirstName,
           String LastName,
           String Company,
           String Address,
           String City,
           String State,
           String Country,
           String PostalCode,
           String Phone,
           String Fax,
           String Email,
           Integer SupportRepId
           ) {}
  ...
}
#+end_src

