docs/articles/ultimate_guide_for_graphql_with_java.html

<div id="outline-container-org94aa881" class="outline-3">
<h3 id="org94aa881">Step 9: <a href="https://netflix.github.io/dgs/#creating-a-schema">Create</a> a GraphQL schema file.</h3>
<div class="outline-text-3" id="text-org94aa881">
<p>
Maven projects have a standard directory layout, and a standard place
within that layout for resource files to be packaged into the build
artifact (a JAR file) is <code>./src/main/java/resources</code>.  Within that
directory, create a sub-directory <code>graphql</code> and deposit a
<code>schema.graphqls</code> file.  There are other ways to organize the GraphQL
schema files needed by graphql-java, DGS, and Spring for GraphQL, but
they all are rooted in <code>./src/main/java/resources</code> (for a Maven
project).
</p>

<p>
Within the <code>schema.graphqls</code> file (or its equivalent), first there
will a definition for the root <code>Query</code> object, with root-level fields
for every GraphQL type that we want in our API.  As a starting point,
there will be a root-level field under <code>Query</code> for every table, and a
corresponding <code>type</code> for every table.  For example, for <code>Query</code>:
</p>

<div class="org-src-container">
<pre class="src src-graphql">type Query {
  Artist(limit: Int): [Artist]
  ArtistById(id: Int): Artist
  Album(limit: Int): [Album]
  AlbumById(id: Int): Album
  Track(limit: Int): [Track]
  TrackById(id: Int): Track
  Playlist(limit: Int): [Playlist]
  PlaylistById(id: Int): Playlist
  PlaylistTrack(limit: Int): [PlaylistTrack]
  PlaylistTrackById(id: Int): PlaylistTrack
  Genre(limit: Int): [Genre]
  GenreById(id: Int): Genre
  MediaType(limit: Int): [MediaType]
  MediaTypeById(id: Int): MediaType
  Customer(limit: Int): [Customer]
  CustoemrById(id: Int): Customer
  Employee(limit: Int): [Employee]
  EmployeeById(id: Int): Employee
  Invoice(limit: Int): [Invoice]
  InvoiceById(id: Int): Invoice
  InvoiceLine(limit: Int): [InvoiceLine]
  InvoiceLineById(id: Int): InvoiceLine
}
</pre>
</div>

<p>
Note the parameters on these fields.  I have written it so that every
root-level field that has a <a href="https://spec.graphql.org/October2021/#sec-Wrapping-Types">List</a> return type accepts one optional
<code>limit</code> parameter which accepts an <code>Int</code>.  The intention is to support
limiting the number of entries that should be returned from a
root-level field.  Note also that every root-level field that has a
<a href="https://spec.graphql.org/October2021/#ScalarTypeDefinition">Scalar</a> object return type accepts one optional <code>id</code> parameter which
also accepts an <code>Int</code>.  The intention is to support fetching a single
entry by its identifier (which happen all to be <code>integer</code> primary keys
in the Chinook data model).
</p>

<p>
Next, here is an illustration of <i>some</i> of the corresponding GraphQL
types:
</p>

<div class="org-src-container">
<pre class="src src-graphql">type Album {
  AlbumId  : Int
  Title    : String
  ArtistId : Int
  Artist   : Artist
  Tracks   : [Track]
}

type Artist {
  ArtistId: Int
  Name: String
  Albums: [Album]
}

type Customer {
  CustomerId   : Int
  FirstName    : String
  LastName     : String
  Company      : String
  Address      : String
  City         : String
  State        : String
  Country      : String
  PostalCode   : String
  Phone        : String
  Fax          : String
  Email        : String
  SupportRepId : Int
  SupportRep   : Employee
  Invoices     : [Invoice]
}
</pre>
</div>

<p>
Fill out the rest of the <code>schema.graphqls</code> file as you see fit,
exposing whatever table (and possibly views, if you create them) you
like.  Or, just use the complete version from the shared repository.
</p>
</div>
</div>

<div id="outline-container-org942bd95" class="outline-3">
<h3 id="org942bd95">Step 10:  Write Java model classes.</h3>
<div class="outline-text-3" id="text-org942bd95">
<p>
Within the standard Maven directory layout, Java source code goes into
<code>./src/main/java</code> and its sub-directories.  Within an appropriate
sub-directory for whatever Java package you use, create Java model
classes.  These can be Plain Old Java Objects (<a href="https://en.wikipedia.org/wiki/Plain_old_Java_object">POJOs</a>).  They can be
Java <a href="https://docs.oracle.com/en/java/javase/17/language/records.html">Record</a> classes.  They can be whatever you like, so long as they
have "getter" and "setter" property methods for the corresponding
fields in the GraphQL schema.  In this guide's repository, I choose
Java Record classes just for the minimal amount of boilerplate.
</p>

<div class="org-src-container">
<pre class="src src-java">  package com.graphqljava.tutorial.retail.models;

  public class ChinookModels {
      public static
          record Album
          (
           Integer AlbumId,
           String Title,
           Integer ArtistId
           ) {}

      public static
          record Artist
          (
           Integer ArtistId,
           String Name
           ) {}

      public static
          record Customer
          (
           Integer CustomerId,
           String FirstName,
           String LastName,
           String Company,
           String Address,
           String City,
           String State,
           String Country,
           String PostalCode,
           String Phone,
           String Fax,
           String Email,
           Integer SupportRepId
           ) {}
  ...
}
</pre>
</div>
</div>
</div>
