articles/ultimate_guide_for_graphql_with_java.org
** Step 11-14:  Write Java controller classes.  Annotate every controller.  Annotate every resolver/data-fetcher.  Implement those resolver/data-fetcher.

These are the Spring ~@Controller~ classes, and within them are the
Spring for GraphQL ~QueryMapping~ and ~@SchemaMapping~
resolver/data-fetcher methods.  These are the real workhorses of the
application, accepting input parameters, mediating interaction with
the database, validating data, implementing (or delegating) to
business logic code segments, arranging for SQL and DML statements to
be sent to the database, returning the data, processing the data, and
sending it along to the GraphQL libraries (graphql-java, DGS, Spring
for GraphQL) to package up and send off to the client.  There are /so/
many choices one can make in implementing these and I can't go into
every detail.  Let me just illustrate how /I/ have done it, highlight
some things to look out for, and discuss some of the options that are
available.

For reference, we will look at a section of the ~ChinookControllers~
file from the example repository.

#+begin_src java
  package com.graphqljava.tutorial.retail.controllers; // It's got to go into a package somewhere.

  import java.sql.ResultSet;	// There's loads of symbols to import.
  import java.sql.SQLException;	// This is Java and there's no getting around that.
  import java.util.List;
  import java.util.Map;
  import java.util.stream.Collectors;

  import org.springframework.beans.factory.annotation.Autowired;
  import org.springframework.graphql.data.ArgumentValue;
  import org.springframework.graphql.data.method.annotation.BatchMapping;
  import org.springframework.graphql.data.method.annotation.QueryMapping;
  import org.springframework.graphql.data.method.annotation.SchemaMapping;
  import org.springframework.jdbc.core.RowMapper;
  import org.springframework.jdbc.core.simple.JdbcClient;
  import org.springframework.jdbc.core.simple.JdbcClient.StatementSpec;
  import org.springframework.stereotype.Controller;

  import com.graphqljava.tutorial.retail.models.ChinookModels.Album;
  import com.graphqljava.tutorial.retail.models.ChinookModels.Artist;
  import com.graphqljava.tutorial.retail.models.ChinookModels.Customer;
  import com.graphqljava.tutorial.retail.models.ChinookModels.Employee;
  import com.graphqljava.tutorial.retail.models.ChinookModels.Genre;
  import com.graphqljava.tutorial.retail.models.ChinookModels.Invoice;
  import com.graphqljava.tutorial.retail.models.ChinookModels.InvoiceLine;
  import com.graphqljava.tutorial.retail.models.ChinookModels.MediaType;
  import com.graphqljava.tutorial.retail.models.ChinookModels.Playlist;
  import com.graphqljava.tutorial.retail.models.ChinookModels.PlaylistTrack;
  import com.graphqljava.tutorial.retail.models.ChinookModels.Track;


  public class ChinookControllers { // You don't have to nest all your controllers in one file. It's just what I do.
      @Controller public static class ArtistController { // Tell Spring about this controller class.
          @Autowired JdbcClient jdbcClient; // Lots of ways to get DB access from the container.  This is one way in Spring Data.
          RowMapper<Artist>		  // I'm not using an ORM, and only a tiny bit of help from Spring Data.
              mapper = new RowMapper<>() {  // Consequently, there are these RowMapper utility classes involved.
                      public Artist mapRow (ResultSet rs, int rowNum) throws SQLException {
                          return
                          new Artist(rs.getInt("ArtistId"),
                                     rs.getString("Name"));}};
          @SchemaMapping Artist Artist (Album album) { // @QueryMapping when we can, @SchemaMapping when we have to
              return				     // Here, we're getting an Artist for a given Album.
                  jdbcClient
                  .sql("select * from \"Artist\" where \"ArtistId\" = ? limit 1") // Simple PreparedStatement wrapper
                  .param(album.ArtistId()) // Fish out the relating field ArtistId and pass it into the PreparedStatement
                  .query(mapper)		 // Use our RowMapper to turn the JDBC Row into the desired model class object.
                  .optional()		 // Use optional to guard against null returns!
                  .orElse(null);}
          @QueryMapping(name = "ArtistById") Artist // Another resolver, this time to get an Artist by its primary key identifier
              artistById (ArgumentValue<Integer> id) { // Note the annotation "name" parameter, when the GraphQL field name doesn't match exactly the method name
              for (Artist a : jdbcClient.sql("select * from \"Artist\" where \"ArtistId\" = ?").param(id.value()).query(mapper).list()) return a;
              return null;}
          @QueryMapping(name = "Artist") List<Artist> // Yet another resolver, this time to get a List of Artists.
              artist (ArgumentValue<Integer> limit) { // Note the one "limit" parameter.  ArgumentValue<T> is the way you do this with GraphQL for Java.
              StatementSpec
                  spec = limit.isOmitted() ? // Switch SQL on whether we did or did not get the limit parameter.
                  jdbcClient.sql("select * from \"Artist\"") :
                  jdbcClient.sql("select * from \"Artist\" limit ?").param(limit.value());
              return		// Run the SQL, map the results, return the List.
                  spec
                  .query(mapper)
                  .list();}}
  ...
#+end_src

There's a lot to unpack here, so let's go through it step by step.
First, I included the ~package~ and ~import~ statements in the example
because all too often, tutorials and guides that you find online elide
these details for brevity.  The problem with that, however, is that
it's /not compilable or runnable code/.  You don't know where these
symbols are coming from, what packages they're in, and what libraries
they're coming from.  Any decent editor like IntelliJ, VSCode, or even
Emacs will help sort this out for you /when you're writing code/, but
you don't have that when reading a blog article.  Moreover, there
/can/ be name conflicts and ambiguities among symbols across
libraries, so even with a smart editor it can leave the reader
scratching their head.

Next, please forgive the nested inner classes.  Feel free to explode
your classes out into their own individual files as you see fit.  This
is just how I do it, largely for pedagogical purposes like this one,
to promote [[https://htmx.org/essays/locality-of-behaviour/][Locality of Behavior]], which is just a fancy way of saying,
"let's not make the reader have to jump through a lot of hoops to
understand the code."

Now for the meat of the code.  Aside from niggling details like "How
do I get a database connection", "How do I map data", etc., the
patterns I want you to see through the forest of code are these:

1. Every field in our schema file (~schema.graphqls~) which isn't a
   simple scalar field (e.g., ~Int~, ~String~, ~Boolean~) probably
   will need a resolver/data-fetcher.
2. Every resolver is implemented with a Java method.
3. Every resolver method gets annotated with ~@SchemaMapping~,
   ~@QueryMapping~, or ~@BatchMapping~ (more on that [[*Step 15: Upgrade /some/ of those resolver/data-fetcher methods with the data loader pattern.][later]]).
4. Use ~@QueryMapping~ when you can because it's simpler.  Use
   ~@SchemaMapping~ when you have to (your IDE should nag you).
5. If you keep the Java method names in sync with the GraphQL field
   names, it's a little less code, but don't make a federal case out
   of it.  You can fix it with a ~name~ parameter in the annotations.
6. Unless you do something different (such as adding filtering,
   sorting, and pagination), you probably will be fetching either a
   single entry by its primary key, or a list of entries.  You /won't/
   be fetching "child" entries; that's handled by the GraphQL
   libraries and the recursive divide-and-conquer way they process
   GraphQL operations.  *Note*: This has implications for performance,
   efficiency, and code complexity.
7. The "something different" in the above item refers to richness that
   you want to add to your GraphQL API.  Want ~limit~ operations?
   Filter predicates?  Aggregations?  Supporting those cases will
   involve more ~ArgumentValue<>~ parameters, more ~SchemaMapping~
   resolver methods, and more combinations thereof.  Deal with it.
8. You /will/ experience the urge to be clever, to create abstractions
   that dynamically respond to more and more complex combinations of
   parameters, filters, and other conditions.  Congratulations:
   you're on your way to building a [[*Is this the /Only/ way to build a GraphQL API server?][general-purpose query engine]].

