docs/articles/ultimate_guide_for_graphql_with_java.html

<div id="outline-container-orgb9b9e50" class="outline-3">
<h3 id="orgb9b9e50">Step 11-14:  Write Java controller classes.  Annotate every controller.  Annotate every resolver/data-fetcher.  Implement those resolver/data-fetcher.</h3>
<div class="outline-text-3" id="text-orgb9b9e50">
<p>
These are the Spring <code>@Controller</code> classes, and within them are the
Spring for GraphQL <code>QueryMapping</code> and <code>@SchemaMapping</code>
resolver/data-fetcher methods.  These are the real workhorses of the
application, accepting input parameters, mediating interaction with
the database, validating data, implementing (or delegating) to
business logic code segments, arranging for SQL and DML statements to
be sent to the database, returning the data, processing the data, and
sending it along to the GraphQL libraries (graphql-java, DGS, Spring
for GraphQL) to package up and send off to the client.  There are <i>so</i>
many choices one can make in implementing these and I can't go into
every detail.  Let me just illustrate how <i>I</i> have done it, highlight
some things to look out for, and discuss some of the options that are
available.
</p>

<p>
For reference, we will look at a section of the <code>ChinookControllers</code>
file from the example repository.
</p>

<div class="org-src-container">
<pre class="src src-java">package com.graphqljava.tutorial.retail.controllers; // It's got to go into a package somewhere.

import java.sql.ResultSet;	// There's loads of symbols to import.
import java.sql.SQLException;	// This is Java and there's no getting around that.
import java.util.List;
import java.util.Map;
import java.util.stream.Collectors;

import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.graphql.data.ArgumentValue;
import org.springframework.graphql.data.method.annotation.BatchMapping;
import org.springframework.graphql.data.method.annotation.QueryMapping;
import org.springframework.graphql.data.method.annotation.SchemaMapping;
import org.springframework.jdbc.core.RowMapper;
import org.springframework.jdbc.core.simple.JdbcClient;
import org.springframework.jdbc.core.simple.JdbcClient.StatementSpec;
import org.springframework.stereotype.Controller;

import com.graphqljava.tutorial.retail.models.ChinookModels.Album;
import com.graphqljava.tutorial.retail.models.ChinookModels.Artist;
import com.graphqljava.tutorial.retail.models.ChinookModels.Customer;
import com.graphqljava.tutorial.retail.models.ChinookModels.Employee;
import com.graphqljava.tutorial.retail.models.ChinookModels.Genre;
import com.graphqljava.tutorial.retail.models.ChinookModels.Invoice;
import com.graphqljava.tutorial.retail.models.ChinookModels.InvoiceLine;
import com.graphqljava.tutorial.retail.models.ChinookModels.MediaType;
import com.graphqljava.tutorial.retail.models.ChinookModels.Playlist;
import com.graphqljava.tutorial.retail.models.ChinookModels.PlaylistTrack;
import com.graphqljava.tutorial.retail.models.ChinookModels.Track;


public class ChinookControllers { // You don't have to nest all your controllers in one file. It's just what I do.
    @Controller public static class ArtistController { // Tell Spring about this controller class.
        @Autowired JdbcClient jdbcClient; // Lots of ways to get DB access from the container.  This is one way in Spring Data.
        RowMapper&lt;Artist&gt;		  // I'm not using an ORM, and only a tiny bit of help from Spring Data.
            mapper = new RowMapper&lt;&gt;() {  // Consequently, there are these RowMapper utility classes involved.
                    public Artist mapRow (ResultSet rs, int rowNum) throws SQLException {
                        return
                        new Artist(rs.getInt("ArtistId"),
                                   rs.getString("Name"));}};
        @SchemaMapping Artist Artist (Album album) { // @QueryMapping when we can, @SchemaMapping when we have to
            return				     // Here, we're getting an Artist for a given Album.
                jdbcClient
                .sql("select * from \"Artist\" where \"ArtistId\" = ? limit 1") // Simple PreparedStatement wrapper
                .param(album.ArtistId()) // Fish out the relating field ArtistId and pass it into the PreparedStatement
                .query(mapper)		 // Use our RowMapper to turn the JDBC Row into the desired model class object.
                .optional()		 // Use optional to guard against null returns!
                .orElse(null);}
        @QueryMapping(name = "ArtistById") Artist // Another resolver, this time to get an Artist by its primary key identifier
            artistById (ArgumentValue&lt;Integer&gt; id) { // Note the annotation "name" parameter, when the GraphQL field name doesn't match exactly the method name
            for (Artist a : jdbcClient.sql("select * from \"Artist\" where \"ArtistId\" = ?").param(id.value()).query(mapper).list()) return a;
            return null;}
        @QueryMapping(name = "Artist") List&lt;Artist&gt; // Yet another resolver, this time to get a List of Artists.
            artist (ArgumentValue&lt;Integer&gt; limit) { // Note the one "limit" parameter.  ArgumentValue&lt;T&gt; is the way you do this with GraphQL for Java.
            StatementSpec
                spec = limit.isOmitted() ? // Switch SQL on whether we did or did not get the limit parameter.
                jdbcClient.sql("select * from \"Artist\"") :
                jdbcClient.sql("select * from \"Artist\" limit ?").param(limit.value());
            return		// Run the SQL, map the results, return the List.
                spec
                .query(mapper)
                .list();}}
...
</pre>
</div>

<p>
There's a lot to unpack here, so let's go through it step by step.
First, I included the <code>package</code> and <code>import</code> statements in the example
because all too often, tutorials and guides that you find online elide
these details for brevity.  The problem with that, however, is that
it's <i>not compilable or runnable code</i>.  You don't know where these
symbols are coming from, what packages they're in, and what libraries
they're coming from.  Any decent editor like IntelliJ, VSCode, or even
Emacs will help sort this out for you <i>when you're writing code</i>, but
you don't have that when reading a blog article.  Moreover, there
<i>can</i> be name conflicts and ambiguities among symbols across
libraries, so even with a smart editor it can leave the reader
scratching their head.
</p>

<p>
Next, please forgive the nested inner classes.  Feel free to explode
your classes out into their own individual files as you see fit.  This
is just how I do it, largely for pedagogical purposes like this one,
to promote <a href="https://htmx.org/essays/locality-of-behaviour/">Locality of Behavior</a>, which is just a fancy way of saying,
"let's not make the reader have to jump through a lot of hoops to
understand the code."
</p>

<p>
Now for the meat of the code.  Aside from niggling details like "How
do I get a database connection", "How do I map data", etc., the
patterns I want you to see through the forest of code are these:
</p>

<ol class="org-ol">
<li>Every field in our schema file (<code>schema.graphqls</code>) which isn't a
simple scalar field (e.g., <code>Int</code>, <code>String</code>, <code>Boolean</code>) probably
will need a resolver/data-fetcher.</li>
<li>Every resolver is implemented with a Java method.</li>
<li>Every resolver method gets annotated with <code>@SchemaMapping</code>,
<code>@QueryMapping</code>, or <code>@BatchMapping</code> (more on that <a href="#org64c9cff">later</a>).</li>
<li>Use <code>@QueryMapping</code> when you can because it's simpler.  Use
<code>@SchemaMapping</code> when you have to (your IDE should nag you).</li>
<li>If you keep the Java method names in sync with the GraphQL field
names, it's a little less code, but don't make a federal case out
of it.  You can fix it with a <code>name</code> parameter in the annotations.</li>
<li>Unless you do something different (such as adding filtering,
sorting, and pagination), you probably will be fetching either a
single entry by its primary key, or a list of entries.  You <i>won't</i>
be fetching "child" entries; that's handled by the GraphQL
libraries and the recursive divide-and-conquer way they process
GraphQL operations.  <b>Note</b>: This has implications for performance,
efficiency, and code complexity.</li>
<li>The "something different" in the above item refers to richness that
you want to add to your GraphQL API.  Want <code>limit</code> operations?
Filter predicates?  Aggregations?  Supporting those cases will
involve more <code>ArgumentValue&lt;&gt;</code> parameters, more <code>SchemaMapping</code>
resolver methods, and more combinations thereof.  Deal with it.</li>
<li>You <i>will</i> experience the urge to be clever, to create abstractions
that dynamically respond to more and more complex combinations of
parameters, filters, and other conditions.  Congratulations:
you're on your way to building a <a href="#orgd3e9d19">general-purpose query engine</a>.</li>
</ol>
</div>
</div>
