articles/ultimate_guide_for_graphql_with_java.org
** Step 15:  Upgrade /some/ of those resolver/data-fetcher methods with the data loader pattern.

You will quickly realize that this can lead to overly chatty
interaction with the database, sending too many small SQL statements
and impacting performance and availability.  This is the proverbial
"N+1" problem.

In a nutshell, the N+1 problem can be illustrated by our Chinook data
model.  Suppose we have this GraphQL query.

#+begin_src graphql
  query {
    Artist(limit: 10) {
      ArtistId
      Album {
        AlbumId
        Track {
          TrackId
        }
      }
    }
  }
#+end_src

1. Get up to 10 ~Artist~ entry.
2. For each ~Artist~, get all of the related ~Album~ entries.
3. For each ~Album~, get all of the related ~Track~ entries.
4. For each entry, just get its identifier field:  ~ArtistId~,
   ~AlbumId~, ~TrackId~.
5. This query is nested 2 levels below ~Artist~.  Let $~n=2~$.
6. ~Album~ is a [[https://spec.graphql.org/October2021/#sec-Wrapping-Types][List]] wrapping type on ~Artist~, as is ~Track~ is a
   [[https://spec.graphql.org/October2021/#sec-Wrapping-Types][List]] wrapping type on ~Album~.  Suppose the typical [[https://en.wikipedia.org/wiki/Cardinality][cardinality]] is
   $m$.

How many SQL statements will typically be involved

1. 1 to fetch 10 ~Artist~ entries.
2. $10*m$ to fetch the ~Album~ entries.
3. $10*m^2$ to fetch the ~Track~ entries.

In general, we can see that the number of queries scales as $m^n$,
which is exponential in $n$.  Of course, observe that the amount of data
retrieved also scales as $m^n$.  In any case, on its face, this
/seems/ like an alarmingly inefficient way to go about fetching these
data.  Is there another way?

There is another way and it it is the standard answer within the
GraphQL community for combating this N+1 problem: the data loader
pattern (aka "batching").  This encompasses two ideas:

1. Rather than fetch the related child entities (e.g. ~Album~) for a
   /single/ parent entity (e.g. ~Artist~) using one identifier, fetch
   the related entities for /all/ of the parent entities in one go,
   using a list of identifiers.
2. Group the resulting child entities according to their respective
   parent entities (in code).
3. While we're at it, we might as well cache the entities for the
   lifetime of executing the one GraphQL operation, in case a given
   entity appears in more than one place in the graph.

Now, for some code.  Here's how this looks in our example.

#+begin_src java
	@BatchMapping(field = "Albums") public Map<Artist, List<Album>> // Switch to @BatchMapping
	    albumsForArtist (List<Artist> artists) { // Take in a List of parents rather than a single parent
	    return
		jdbcClient
		.sql("select * from \"Album\" where \"ArtistId\" in (:ids)") // Use a SQL "in" predicate taking a list of identifiers
		.param("ids", artists.stream().map(x -> x.ArtistId()).toList()) // Fish the list of identifiers out of the list of parent objects
		.query(mapper)	// Can re-use our usual mapper
		.list()
		.stream().collect(Collectors.groupingBy(x -> artists.stream().collect(Collectors.groupingBy(Artist::ArtistId)).get(x.ArtistId()).getFirst()));
	    // ^ Java idiom for grouping child Albums according to their parent Albums
	}
#+end_src

Like before, let's unpack this.  First, we switch from either the
~@QueryMapping~ or ~@SchemaMapping~ annotation to ~@BatchMapping~, to
signal to Spring for GraphQL that we want to use the data loader
pattern.  Second, we switch from a single ~Artist~ parameter to a
~List<Artist>~ parameter.  Third, we somehow have to arrange the
necessary SQL (with an ~in~ predicate in this case) and the
corresponding parameter (a ~List<Integer>~ extracted from the
~List<Album>~ parameter).  Fourth, we have somehow have to arrange for
the child entries (~Album~ in this case) to get sorted to the right
parent entries (~Album~ in this case).  There are many ways to do it,
and this is just one way.  The important point is that however it's
done, /it has to be done in Java/.  One last thing: note the absence
of the ~limit~ parameter.  Where did that go?  It turns out that
~InputValue<T>~ is not supported by Spring for GraphQL for
~@BatchMapping~.  Oh well! 😒 In this case, it's no great loss because
arguably these ~limit~ parameters make little sense.  How often does
one really need a random subset of an artist's albums?  It's a more
serious issue if we had filtering and sorting, however.  Filtering and
sorting parameters are more justified, and if we had them we would
somehow have to find a way to sneak them into the data loader pattern.
Presumably, it can be done, but it will not be so easy as just
slapping a ~@BatchMapping~ annotation onto the method and tinkering
with [[https://www.oracle.com/technical-resources/articles/java/ma14-java-se-8-streams.html][Java streams]].

*** Editorial Aside!

#+begin_details
This raises an important point about the "N+1 problem" that is /never/
addressed, and that neglect just serves to exaggerate the scale of the
problem in a real world setting.  /If/ we have limits and/or
filtering, then we have a way of reducing the cardinality of related
child entities below $m$ (recall that we took $m$ to be the typical
cardinality of a child entity).  In a real world setting /limits or
more precisely filtering are necessary for usability/.  GraphQL APIs
are meant for humans, in that at the end of the day, the data are
being painted onto a screen or in some other way presented to a human
user who then has to absorb and process those data.  Humans have
severe limits in perception, cognition, and memory, for the quantity
of data we can process.  Only another machine (i.e. computers) could
possibly process a large volume of data, but if you're extracting
large volumes of data from one machine to another, then you are
building an [[https://en.wikipedia.org/wiki/Extract,_transform,_load][ETL]] pipeline.  If you are using GraphQL for ETL then /you
are doing it wrong/ and should stop immediately!

In any event, in a real world setting, with human users, both $m$ and
$n$ will be very small.  The number of SQL queries /will not/ scale as
$m^n$ to very large numbers.  Effectively, the N+1 problem will
inflate the number of SQL queries not by an /arbitrarily large
factor/, but by approximately a /constant factor/.  In a well-designed
application, it probably will be a constant factor well below 100.
Consider this when balancing the trade-offs in developer time, in
complexity, and in hardware scaling, when confronting the N+1 problem.
#+end_details

