docs/articles/ultimate_guide_for_graphql_with_java.html

<div id="outline-container-org64c9cff" class="outline-3">
<h3 id="org64c9cff">Step 15:  Upgrade <i>some</i> of those resolver/data-fetcher methods with the data loader pattern.</h3>
<div class="outline-text-3" id="text-org64c9cff">
<p>
You will quickly realize that this can lead to overly chatty
interaction with the database, sending too many small SQL statements
and impacting performance and availability.  This is the proverbial
"N+1" problem.
</p>

<p>
In a nutshell, the N+1 problem can be illustrated by our Chinook data
model.  Suppose we have this GraphQL query.
</p>

<div class="org-src-container">
<pre class="src src-graphql">query {
  Artist(limit: 10) {
    ArtistId
    Album {
      AlbumId
      Track {
        TrackId
      }
    }
  }
}
</pre>
</div>

<ol class="org-ol">
<li>Get up to 10 <code>Artist</code> entry.</li>
<li>For each <code>Artist</code>, get all of the related <code>Album</code> entries.</li>
<li>For each <code>Album</code>, get all of the related <code>Track</code> entries.</li>
<li>For each entry, just get its identifier field:  <code>ArtistId</code>,
<code>AlbumId</code>, <code>TrackId</code>.</li>
<li>This query is nested 2 levels below <code>Artist</code>.  Let \(~n=2~\).</li>
<li><code>Album</code> is a <a href="https://spec.graphql.org/October2021/#sec-Wrapping-Types">List</a> wrapping type on <code>Artist</code>, as is <code>Track</code> is a
<a href="https://spec.graphql.org/October2021/#sec-Wrapping-Types">List</a> wrapping type on <code>Album</code>.  Suppose the typical <a href="https://en.wikipedia.org/wiki/Cardinality">cardinality</a> is
\(m\).</li>
</ol>

<p>
How many SQL statements will typically be involved
</p>

<ol class="org-ol">
<li>1 to fetch 10 <code>Artist</code> entries.</li>
<li>\(10*m\) to fetch the <code>Album</code> entries.</li>
<li>\(10*m^2\) to fetch the <code>Track</code> entries.</li>
</ol>

<p>
In general, we can see that the number of queries scales as \(m^n\),
which is exponential in \(n\).  Of course, observe that the amount of data
retrieved also scales as \(m^n\).  In any case, on its face, this
<i>seems</i> like an alarmingly inefficient way to go about fetching these
data.  Is there another way?
</p>

<p>
There is another way and it it is the standard answer within the
GraphQL community for combating this N+1 problem: the data loader
pattern (aka "batching").  This encompasses two ideas:
</p>

<ol class="org-ol">
<li>Rather than fetch the related child entities (e.g. <code>Album</code>) for a
<i>single</i> parent entity (e.g. <code>Artist</code>) using one identifier, fetch
the related entities for <i>all</i> of the parent entities in one go,
using a list of identifiers.</li>
<li>Group the resulting child entities according to their respective
parent entities (in code).</li>
<li>While we're at it, we might as well cache the entities for the
lifetime of executing the one GraphQL operation, in case a given
entity appears in more than one place in the graph.</li>
</ol>

<p>
Now, for some code.  Here's how this looks in our example.
</p>

<div class="org-src-container">
<pre class="src src-java">@BatchMapping(field = "Albums") public Map&lt;Artist, List&lt;Album&gt;&gt; // Switch to @BatchMapping
    albumsForArtist (List&lt;Artist&gt; artists) { // Take in a List of parents rather than a single parent
    return
        jdbcClient
        .sql("select * from \"Album\" where \"ArtistId\" in (:ids)") // Use a SQL "in" predicate taking a list of identifiers
        .param("ids", artists.stream().map(x -&gt; x.ArtistId()).toList()) // Fish the list of identifiers out of the list of parent objects
        .query(mapper)	// Can re-use our usual mapper
        .list()
        .stream().collect(Collectors.groupingBy(x -&gt; artists.stream().collect(Collectors.groupingBy(Artist::ArtistId)).get(x.ArtistId()).getFirst()));
    // ^ Java idiom for grouping child Albums according to their parent Albums
}
</pre>
</div>

<p>
Like before, let's unpack this.  First, we switch from either the
<code>@QueryMapping</code> or <code>@SchemaMapping</code> annotation to <code>@BatchMapping</code>, to
signal to Spring for GraphQL that we want to use the data loader
pattern.  Second, we switch from a single <code>Artist</code> parameter to a
<code>List&lt;Artist&gt;</code> parameter.  Third, we somehow have to arrange the
necessary SQL (with an <code>in</code> predicate in this case) and the
corresponding parameter (a <code>List&lt;Integer&gt;</code> extracted from the
<code>List&lt;Album&gt;</code> parameter).  Fourth, we have somehow have to arrange for
the child entries (<code>Album</code> in this case) to get sorted to the right
parent entries (<code>Album</code> in this case).  There are many ways to do it,
and this is just one way.  The important point is that however it's
done, <i>it has to be done in Java</i>.  One last thing: note the absence
of the <code>limit</code> parameter.  Where did that go?  It turns out that
<code>InputValue&lt;T&gt;</code> is not supported by Spring for GraphQL for
<code>@BatchMapping</code>.  Oh well! 😒 In this case, it's no great loss because
arguably these <code>limit</code> parameters make little sense.  How often does
one really need a random subset of an artist's albums?  It's a more
serious issue if we had filtering and sorting, however.  Filtering and
sorting parameters are more justified, and if we had them we would
somehow have to find a way to sneak them into the data loader pattern.
Presumably, it can be done, but it will not be so easy as just
slapping a <code>@BatchMapping</code> annotation onto the method and tinkering
with <a href="https://www.oracle.com/technical-resources/articles/java/ma14-java-se-8-streams.html">Java streams</a>.
</p>
</div>

<div id="outline-container-org4d6be9f" class="outline-4">
<h4 id="org4d6be9f">Editorial Aside!</h4>
<div class="outline-text-4" id="text-org4d6be9f">
<details id="orgf0e83cb">
<p>
This raises an important point about the "N+1 problem" that is <i>never</i>
addressed, and that neglect just serves to exaggerate the scale of the
problem in a real world setting.  <i>If</i> we have limits and/or
filtering, then we have a way of reducing the cardinality of related
child entities below \(m\) (recall that we took \(m\) to be the typical
cardinality of a child entity).  In a real world setting <i>limits or
more precisely filtering are necessary for usability</i>.  GraphQL APIs
are meant for humans, in that at the end of the day, the data are
being painted onto a screen or in some other way presented to a human
user who then has to absorb and process those data.  Humans have
severe limits in perception, cognition, and memory, for the quantity
of data we can process.  Only another machine (i.e. computers) could
possibly process a large volume of data, but if you're extracting
large volumes of data from one machine to another, then you are
building an <a href="https://en.wikipedia.org/wiki/Extract,_transform,_load">ETL</a> pipeline.  If you are using GraphQL for ETL then <i>you
are doing it wrong</i> and should stop immediately!
</p>

<p>
In any event, in a real world setting, with human users, both \(m\) and
\(n\) will be very small.  The number of SQL queries <i>will not</i> scale as
\(m^n\) to very large numbers.  Effectively, the N+1 problem will
inflate the number of SQL queries not by an <i>arbitrarily large
factor</i>, but by approximately a <i>constant factor</i>.  In a well-designed
application, it probably will be a constant factor well below 100.
Consider this when balancing the trade-offs in developer time, in
complexity, and in hardware scaling, when confronting the N+1 problem.
</p>
</details>
</div>
</div>
</div>
</div>
