articles/ultimate_guide_for_graphql_with_java.org
* Is this the /Only/ way to build a GraphQL API server?

We saw that the "easy way" of building GraphQL servers is the one
typically offered in tutorials and "Getting Started" guides, and is
over tiny unrealistic in-memory data models, without a database.

We saw that the "real way" of building GraphQL servers (in Java)
described in some detail above, regardless of library or framework,
involves:

- writing schema file entries, possibly for every table
- writing Java model classes, possibly for every table
- writing Java resolver methods, possibly for every field in every table
- eventually writing code to solve arbitrarily complex compositions of
  input parameters
- writing code to budget SQL operations efficiently

We also observe that GraphQL lends itself to a "recursive
[[https://en.wikipedia.org/wiki/Divide-and-conquer_algorithm][divide-and-conquer]] with an accumulator approach": a GraphQL query is
recursively divided and sub-divided along type and field boundaries
into a "graph", internal nodes in the graph are processed individually
by resolvers, but the data are passed up the graph [[https://en.wikipedia.org/wiki/Dataflow_programming][dataflow]] style,
accumulating into a JSON envelope that is returned to the user.  The
GraphQL libraries are decomposing the incoming queries into something
like an Abstract Syntax Tree ([[https://en.wikipedia.org/wiki/Abstract_syntax_tree][AST]]), firing SQL statements for all the
internal nodes (ignoring the data loader pattern for a moment), then
re-composing the data.  And, we are its willing accomplices!

We /also/ observe that building GraphQL servers according to the above
recipes leads to other outcomes:

- lots of repetition
- lots of boilerplate code
- bespoke servers
- that are tied to a particular data model

Build a GraphQL server more than once according to the above recipes
and you will make these observations.  Making these observations, you
will naturally feel a powerful urge to build more sophisticated
abstractions that reduce the repetition, reduce the boilerplate,
generalize the servers, and decouple them from any particular data
model.  This is what I call the "natural way" of building a GraphQL
API, as it's a natural evolution from the trivial "easy way" of
tutorials and "Getting Started" guides, and from the cumbersome "real
way" of resolvers and even data loaders.

Building a GraphQL server with a network of nested resolvers offers
some flexibility and dynamism, and requires a lot of code.  Adding in
more flexibility and dynamism with limits, pagination, filtering, and
sorting, requires more code still. And while it may be dynamic, it
will also be very chatty with the database, as we saw.  Reducing the
chattiness necessitates composing the many fragmentary SQL statements
into fewer SQL statements which individually do more work.  That's
what the data loader pattern does: it reduces the number of SQL
statements from "a few tens" to "less than 10 but more than 1".  In
practice, that may not be a huge win and it comes at the cost of
developer time and lost dynamism, but it /is/ a step down the path of
generating fewer, more sophisticated queries.  The terminus of that
path is "1": the optimal number of SQL statements (ignoring caching)
is 1.  Generate one giant SQL statement that does /all/ the work of
fetching the data, teach it to generate JSON while you're at it, and
this is the best you will ever do with a GraphQL server (for a
relational database).  It will be hard work, but you can take solace
that having done it once, it need not ever be done again if you do it
right, by introspecting the database to /generate/ the schema.

Do /that/, and what you will build won't be so much a "GraphQL API
server" as a "GraphQL to SQL compiler."  If that gives you pause,
consider that this is what you were already doing all along, anyway.
+The easy way+, the real way, the natural way:  they're +all+ both
necessarily GraphQL to SQL compilers!  They just lie along a spectrum
of versatility, flexibility, and efficiency.  Acknowledge that
building a GraphQL to SQL compiler is what you were doing all along,
embrace that fact, and lean into it, and you may never need to build
another GraphQL server again.  What could be better than that?

One thing that could be better than building your last GraphQL server,
or your only GraphQL server, is never building a GraphQL server in the
first place.  After all, your goal wasn't to /build/ a GraphQL API,
but rather to /have/ a GraphQL API.  The easiest way to /have/ a
GraphQL API is just to go get one.  Get one for free if you can.  Buy
one if the needs justify it.  This is the [[https://en.wikipedia.org/wiki/Boss_(video_games)#Final_boss][final boss]] on the journey of
GraphQL maturity.

