articles/ultimate_guide_for_graphql_with_java.org
* How to choose "Buy" over "Buy"

You don't /literally/ need to /buy/ a GraphQL server.  You can, and
there can be good reasons to do so in some settings, but there are
other options.  What I really mean to address is the decision over
whether or not to /build/ a GraphQL server.  In some cases, this may
be warranted, but in most cases /it is not/.

It /does/ depend on the data sources involved.  If there are
[[https://www.postgresql.org/][PostgreSQL]] databases or [[https://wiki.postgresql.org/wiki/PostgreSQL_derived_databases][PostgreSQL-ish]] databases for which we want
APIs, then we are blessed with many fine choices.

First, in this case it pays to consider whether or not we truly need a
/GraphQL/ API.  How do we decide if we need a GraphQL API?  Of course,
there's no right answer, but the following considerations are useful
guide.

- Are your data consumers humans or machines? :: If they're machines
  /you DO NOT need GraphQL/.
- Similarly, are you serving [[https://en.wikipedia.org/wiki/Extract,_transform,_load][ETL]] use cases? :: If you're performing ETL
  /you DO NOT need GraphQL/.
- Do you have primarily [[https://en.wikipedia.org/wiki/Online_analytical_processing][analytical]] workloads? :: If you're serving
  analytical workloads /you DO NOT need GraphQL/.
- Do you have a public, semi-public, or private API? :: Well, it depends.
  - Public :: /You MAY have GraphQL/.  GraphQL is a good choice for
    fully public freely-available APIs because of its flexibility,
    efficiency, and especially its discoverability.  You /will/ have
    to take steps to secure the API against [[https://en.wikipedia.org/wiki/Denial-of-service_attack][DoS]] attacks (rate
    limits, time limits, query complexity limits, throttling) but
    probably not against exfiltration or tampering.  You probably won't
    need query white-listing and you probably won't want to turn off
    GraphQL introspection queries.  Tampering probably won't be an
    issue as typically these are read-only APIs.  In any case, when
    you cannot anticipate the range of queries, GraphQL is a good
    choice. 
  - Semi-public :: /You MAY have GraphQL/.  GraphQL is a good choice
    for semi-public APIs, such as those secured by credentials,
    subject to authorization, and open only to select customers and
    partners, but still operating over the open internet.
    Denial-of-Service (DoS) attacks are still a threat, though less
    so, but now exfiltration and especially tampering are bigger
    concerns.  Like with a public API, if you cannot anticipate the
    full range of queries and other operations, GraphQL is a good
    choice. 
  - Private :: /You MAY NOT NEED GraphQL/.  This is the most
    interesting case to me.  In this setting, the clients are
    typically developed /in-house/.  A firm's "back-end" teams supply
    APIs that are used by the same firm's "front-end" teams.  API
    calls may still go over the open internet, as with a mobile app,
    but they're typically "baked-in" with the app.  The range of API
    calls is /finite/ and /known in advance/.  In this case, there's
    little need for GraphQL discoverability and even flexibility, at
    least in the production environment.  You can and /should/ disable
    introspection queries, and you /should/ consider white-listing.
    At this point, however, it throws into question the /value/ of a
    GraphQL API.  If you know all of the operations in advance /you
    MAY just use REST!/

With those considerations in mind, we return to the subject of
/acquiring/ an API server over building one, and in that case which
one to acquire.  If you don't /need/ a GraphQL API--perhaps because
you have private API needs, you /may/ stick with REST.  If you have
PostgreSQL or PostgreSQL-ish databases, [[https://postgrest.org/][PostgREST]] is a very good
open-source choice.

If you /do/ need a GraphQL API, and you are on PostgreSQL, then
[[https://www.graphile.org/postgraphile/][PostGraphile]] is another very good open-source choice.

If you add other databases to the mix, however, the choices narrow
considerably.  [[https://hasura.io/opensource/][Hasura Community Edition]] is a good choice, but
unfortunately that Open-Source version only works with PostgreSQL.  If
you are not constrained by free tools, however, [[https://hasura.io/enterprise/][Hasura Enterprise]]
expands support to include Microsoft SQL Server, MySQL, Oracle, and a
host of other databases.

* Wrapping up

What I'd like you to take away from this article are these things.

- GraphQL is a general-purpose query language, like SQL.
- GraphQL is less powerful than SQL.
- GraphQL is simpler than SQL.
- But, that simplicity and diminution of power make it good for web APIs.
- GraphQL is meant for humans.
- Therefore, don't use GraphQL for ETL.
- GraphQL is meant for transactional workloads.
- Therefore, don't use GraphQL for analytical or OLAP.
- GraphQL is useful for public and semi-public APIs.
- Consider treating GraphQL just as a /development/ tool for private APIs.
- But then for private APIs, you might as well just substitute SQL for development.
- If you do go with GraphQL, seriously consider /acquiring/ a GraphQL
  server rather than building one.
- To acquire a GraphQL server, you're on firmest ground if you're
  using PostgreSQL.
- If you go with building a GraphQL server and you're using Java, this
  guide is a good start.
- For that case, I go well beyond the usual tutorials and "Getting
  Started" guides to get you started building a real server in Java.
- However, strap yourself in.  It's a lot of work.
- You will write a lot of boilerplate, in schema files, model files,
  controller files, and maybe ORM mapping files.
- Consequently, resist lectures about "not exposing your data model"
  because doing anything else for a large data model is a ton of work.
- /Probably/ resist an pressure internal or external to use an ORM.
  It probably won't help and will only hurt.
- Adding expressivity to your GraphQL API--the /raison d'etre of
  GraphQL/--requires a lot of work.
- /Nominally/, that expressivivity also comes at the cost of
  efficiency and performance.
- That lost efficiency and performance is known as the "N+1 problem."
- However, the N+1 problem is probably way overblown for APIs that
  serve humans (see above).
- If you're starting a GraphQL server in Java, and you're not using
  Spring Boot, choose graphql-java and stop there.
- If you're starting a GraphQL server in Java, and you ARE using
  Spring Boot, prefer Spring for GraphQL over Netflix DGS.

#  LocalWords:  runtime Initializr QueryMapping YugaByte InvoiceLine
#  LocalWords:  MediaType PlaylistTrack ArtistById AlbumById AlbumId
#  LocalWords:  TrackById PlaylistById PlaylistTrackById GenreById
#  LocalWords:  MediaTypeById CustoemrById EmployeeById InvoiceById
#  LocalWords:  InvoiceLineById ArtistId CustomerId FirstName mapRow
#  LocalWords:  LastName PostalCode SupportRepId SupportRep Autowired
#  LocalWords:  ChinookModels ChinookControllers ArtistController
#  LocalWords:  JdbcClient jdbcClient RowMapper ResultSet rowNum
#  LocalWords:  SQLException getInt getString SchemaMapping param
#  LocalWords:  PreparedStatement orElse artistById ArgumentValue
#  LocalWords:  StatementSpec isOmitted compilable TrackId graphy
#  LocalWords:  BatchMapping albumsForArtist
