docs/articles/ultimate_guide_for_graphql_with_java.html

<div id="outline-container-orge86cd9c" class="outline-2">
<h2 id="orge86cd9c">How to choose "Buy" over "Buy"</h2>
<div class="outline-text-2" id="text-orge86cd9c">
<p>
You don't <i>literally</i> need to <i>buy</i> a GraphQL server.  You can, and
there can be good reasons to do so in some settings, but there are
other options.  What I really mean to address is the decision over
whether or not to <i>build</i> a GraphQL server.  In some cases, this may
be warranted, but in most cases <i>it is not</i>.
</p>

<p>
It <i>does</i> depend on the data sources involved.  If there are
<a href="https://www.postgresql.org/">PostgreSQL</a> databases or <a href="https://wiki.postgresql.org/wiki/PostgreSQL_derived_databases">PostgreSQL-ish</a> databases for which we want
APIs, then we are blessed with many fine choices.
</p>

<p>
First, in this case it pays to consider whether or not we truly need a
<i>GraphQL</i> API.  How do we decide if we need a GraphQL API?  Of course,
there's no right answer, but the following considerations are useful
guide.
</p>

<dl class="org-dl">
<dt>Are your data consumers humans or machines?</dt><dd>If they're machines
<i>you DO NOT need GraphQL</i>.</dd>
<dt>Similarly, are you serving <a href="https://en.wikipedia.org/wiki/Extract,_transform,_load">ETL</a> use cases?</dt><dd>If you're performing ETL
<i>you DO NOT need GraphQL</i>.</dd>
<dt>Do you have primarily <a href="https://en.wikipedia.org/wiki/Online_analytical_processing">analytical</a> workloads?</dt><dd>If you're serving
analytical workloads <i>you DO NOT need GraphQL</i>.</dd>
<dt>Do you have a public, semi-public, or private API?</dt><dd>Well, it depends.
<dl class="org-dl">
<dt>Public</dt><dd><i>You MAY have GraphQL</i>.  GraphQL is a good choice for
fully public freely-available APIs because of its flexibility,
efficiency, and especially its discoverability.  You <i>will</i> have
to take steps to secure the API against <a href="https://en.wikipedia.org/wiki/Denial-of-service_attack">DoS</a> attacks (rate
limits, time limits, query complexity limits, throttling) but
probably not against exfiltration or tampering.  You probably won't
need query white-listing and you probably won't want to turn off
GraphQL introspection queries.  Tampering probably won't be an
issue as typically these are read-only APIs.  In any case, when
you cannot anticipate the range of queries, GraphQL is a good
choice.</dd>
<dt>Semi-public</dt><dd><i>You MAY have GraphQL</i>.  GraphQL is a good choice
for semi-public APIs, such as those secured by credentials,
subject to authorization, and open only to select customers and
partners, but still operating over the open internet.
Denial-of-Service (DoS) attacks are still a threat, though less
so, but now exfiltration and especially tampering are bigger
concerns.  Like with a public API, if you cannot anticipate the
full range of queries and other operations, GraphQL is a good
choice.</dd>
<dt>Private</dt><dd><i>You MAY NOT NEED GraphQL</i>.  This is the most
interesting case to me.  In this setting, the clients are
typically developed <i>in-house</i>.  A firm's "back-end" teams supply
APIs that are used by the same firm's "front-end" teams.  API
calls may still go over the open internet, as with a mobile app,
but they're typically "baked-in" with the app.  The range of API
calls is <i>finite</i> and <i>known in advance</i>.  In this case, there's
little need for GraphQL discoverability and even flexibility, at
least in the production environment.  You can and <i>should</i> disable
introspection queries, and you <i>should</i> consider white-listing.
At this point, however, it throws into question the <i>value</i> of a
GraphQL API.  If you know all of the operations in advance <i>you
MAY just use REST!</i></dd>
</dl></dd>
</dl>

<p>
With those considerations in mind, we return to the subject of
<i>acquiring</i> an API server over building one, and in that case which
one to acquire.  If you don't <i>need</i> a GraphQL API&#x2013;perhaps because
you have private API needs, you <i>may</i> stick with REST.  If you have
PostgreSQL or PostgreSQL-ish databases, <a href="https://postgrest.org/">PostgREST</a> is a very good
open-source choice.
</p>

<p>
If you <i>do</i> need a GraphQL API, and you are on PostgreSQL, then
<a href="https://www.graphile.org/postgraphile/">PostGraphile</a> is another very good open-source choice.
</p>

<p>
If you add other databases to the mix, however, the choices narrow
considerably.  <a href="https://hasura.io/opensource/">Hasura Community Edition</a> is a good choice, but
unfortunately that Open-Source version only works with PostgreSQL.  If
you are not constrained by free tools, however, <a href="https://hasura.io/enterprise/">Hasura Enterprise</a>
expands support to include Microsoft SQL Server, MySQL, Oracle, and a
host of other databases.
</p>
</div>
</div>

<div id="outline-container-org7376402" class="outline-2">
<h2 id="org7376402">Wrapping up</h2>
<div class="outline-text-2" id="text-org7376402">
<p>
What I'd like you to take away from this article are these things.
</p>

<ul class="org-ul">
<li>GraphQL is a general-purpose query language, like SQL.</li>
<li>GraphQL is less powerful than SQL.</li>
<li>GraphQL is simpler than SQL.</li>
<li>But, that simplicity and diminution of power make it good for web APIs.</li>
<li>GraphQL is meant for humans.</li>
<li>Therefore, don't use GraphQL for ETL.</li>
<li>GraphQL is meant for transactional workloads.</li>
<li>Therefore, don't use GraphQL for analytical or OLAP.</li>
<li>GraphQL is useful for public and semi-public APIs.</li>
<li>Consider treating GraphQL just as a <i>development</i> tool for private APIs.</li>
<li>But then for private APIs, you might as well just substitute SQL for development.</li>
<li>If you do go with GraphQL, seriously consider <i>acquiring</i> a GraphQL
server rather than building one.</li>
<li>To acquire a GraphQL server, you're on firmest ground if you're
using PostgreSQL.</li>
<li>If you go with building a GraphQL server and you're using Java, this
guide is a good start.</li>
<li>For that case, I go well beyond the usual tutorials and "Getting
Started" guides to get you started building a real server in Java.</li>
<li>However, strap yourself in.  It's a lot of work.</li>
<li>You will write a lot of boilerplate, in schema files, model files,
controller files, and maybe ORM mapping files.</li>
<li>Consequently, resist lectures about "not exposing your data model"
because doing anything else for a large data model is a ton of work.</li>
<li><i>Probably</i> resist an pressure internal or external to use an ORM.
It probably won't help and will only hurt.</li>
<li>Adding expressivity to your GraphQL API&#x2013;the <i>raison d'etre of
GraphQL</i>&#x2013;requires a lot of work.</li>
<li><i>Nominally</i>, that expressivity also comes at the cost of
efficiency and performance.</li>
<li>That lost efficiency and performance is known as the "N+1 problem."</li>
<li>However, the N+1 problem is probably way overblown for APIs that
serve humans (see above).</li>
<li>If you're starting a GraphQL server in Java, and you're not using
Spring Boot, choose graphql-java and stop there.</li>
<li>If you're starting a GraphQL server in Java, and you ARE using
Spring Boot, prefer Spring for GraphQL over Netflix DGS.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<footer>
  <p>&copy; 2014-2025 David A. Ventimiglia
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</div>
</body>
</html>
